Repository: nonomal/Mycodo
Catalog: mycodo/mycodo_flask/translations/*/LC_MESSAGES/messages.po
Languages: de, zh

source: Integrator Min
zh: 积分器Min

source: Integrator Max
zh: 积分器Max

source: SMTP Host
zh: SMTP主机

source: SMTP Port
zh: SMTP端口

source: Pyro Timeout
zh: 火焰兵超时

source: Internet Test Port
zh: 互联网测试端口

source: Internet Test Timeout
zh: 互联网测试超时

source: Info
zh: 信息

source: Raspberry Pi
zh: 树莓派

source: Mycodo Logs
zh: Mycodo日志

source: System Information
zh: 系统信息

source: Upgrade
zh: 升级

source: Video Stream
zh: 视频流

source: Mycodo Version
zh: Mycodo版本

source: Python Version
zh: Python版本

source: Daemon Status
zh: 守护进程状态

source: Export Import
zh: 出口进口
