Repository: nonomal/Mycodo
Catalog: mycodo/mycodo_flask/translations/*/LC_MESSAGES/messages.po
Languages: de, zh

source: Acceleration
de: Beschleunigung
zh: 加速

source: Altitude
de: Höhenlage
zh: 高度

source: Angle
de: Winkel
zh: 角度

source: Battery
de: Batterie
zh: 电池

source: Brightness
de: Helligkeit
zh: 亮度

source: Carbon Dioxide
de: Kohlendioxid
zh: 二氧化碳

source: Color
de: Farbe
zh: 颜色

source: Red
de: Rot
zh: 红

source: Green
de: Grün
zh: 绿

source: Blue
de: Blau
zh: 蓝

source: Color Temperature
de: Farbtemperatur
zh: 色温

source: CPU Load
de: CPU-Last
zh: CPU负载

source: Minutes
de: Protokoll
zh: 分钟

source: Dewpoint
de: Taupunkt
zh: 露点

source: Direction
de: Richtung
zh: 方向

source: Disk
de: Festplatte
zh: 磁盘

source: Dissolved Oxygen
de: Gelöster Sauerstoff
zh: 溶解氧

source: Duration
de: Laufzeit
zh: 持续时间

source: Duty Cycle
de: Einschaltdauer
zh: 占空比

source: GPIO Edge
de: GPIO Begrenzung

source: Electrical Conductivity
de: Elektrische Leitfähigkeit
zh: 电导率

source: Electrical Current
de: Elektrischer Strom
zh: 电流

source: Electrical Potential
de: Elektrisches Potenzial
zh: 电势

source: Energy
de: Energie
zh: 能源

source: Frequency
de: Frequenz
zh: 频率

source: GPIO State
de: GPIO Status
zh: GPIO国家

source: Hue
de: Farbton
zh: 色调

source: Humidity
de: Feuchtigkeit
zh: 湿度

source: Humidity Ratio
de: Feuchtigkeitsfaktor
zh: 湿度比

source: Ion Concentration
de: Ionenkonzentration
zh: 离子浓度

source: Length
de: Länge
zh: 长度

source: Light
de: Licht
zh: 光

source: Magnetic Flux Density
de: Magnetische Flussdichte
zh: 磁通密度

source: Methane
de: Methan

source: Moisture
de: Feuchtigkeit
zh: 湿气

source: Oxygen
de: Sauerstoff
zh: 氧气

source: Oxidation Reduction Potential
de: Oxidations-Reduktions-Potential
zh: 氧化还原电位

source: PID P-Value
de: PID P-Wert
zh: PID P值

source: PID I-Value
de: PID I-Wert
zh: PID I值

source: PID D-Value
de: PID D-Wert
zh: PID D值

source: Power
de: Strom
zh: 权力

source: Apparent Power
de: Scheinbare Leistung
zh: 表观功率

source: Power Factor
de: Leistungsfaktor
zh: 功率因数

source: Reactive Power
de: Blindleistung
zh: 无功功率

source: Pressure
de: Druck
zh: 压力

source: Pulse Width
de: Impuls Weite
zh: 脉冲宽度

source: Radiation Dose Rate
de: Strahlungsdosisrate
zh: 辐射剂量率

source: Volume Flow Rate
de: Volumenstrom
zh: 体积流量

source: Resistance
de: Widerstand
zh: 抵抗性

source: Rotation
de: Drehung
zh: 旋转

source: Revolutions
de: Revolutionen
zh: 革命

source: Salinity
de: Salzgehalt
zh: 盐度

source: Saturation
de: Sättigung
zh: 饱和

source: Setpoint
de: Sollwert
zh: 设定点

source: Band Min
de: Band minimal

source: Band Max
de: Band maximal

source: Specific Enthalpy
de: Spezifischer Wärmeinhalt
zh: 具体焓

source: Specific Gravity
de: Spezifische Schwerkraft
zh: 比重

source: Specific Volume
de: Spezifisches Volumen
zh: 比容

source: Speed
de: Geschwindigkeit
zh: 速度

source: Temperature
de: Temperatur
zh: 温度

source: Total Dissolved Solids
de: Abdampfrückstand
zh: 溶解性总固体

source: Unitless
de: ohne Einheit
zh: 无单位

source: Vapor Pressure Deficit
de: Dampfdruckdefizit
zh: 蒸汽压不足

source: Version
de: Ausführung
zh: 版

source: Volume
de: Volumen
zh: 体积

source: Microsecond
de: Mikrosekunde
zh: 微秒

source: Microsiemens per centimeter
de: Microsiemens pro Zentimeter
zh: 每厘米微米门

source: Microsieverts per hour
de: Mikrosievert pro Stunde
zh: 每小时微西弗

source: Amp
de: Ampere
zh: 安培

source: Bearing
de: Lager
zh: 軸承

source: Centimeter
de: Zentimeter
zh: 厘米

source: Centimeters of water
de: Zentimeter Wasser
zh: 水的厘米数

source: Counts per minute
de: Zählungen pro Minute
zh: 每分钟的计数

source: Decimal
de: Dezimal
zh: 十进制

source: Degree
de: Grad
zh: 度

source: 8-Bit Color
de: 8-Bit-Farbe
zh: 8位色彩

source: Foot
de: Fuß
zh: 英寸

source: Full
de: Voll
zh: 充分

source: G-Force
de: G-Kraft
zh: G力

source: Hour
de: Stunde
zh: 小时

source: Hectopascals
de: Hektopascal
zh: 百万帕斯卡

source: Infrared
de: Infrarot
zh: 红外线

source: Kilogram per kilogram
de: Kilogramm pro Kilogramm
zh: 公斤每公斤

source: Kilojoule per kilogram
de: Kilojoule pro Kilogramm
zh: 千焦尔每公斤

source: Knot
de: Knoten
zh: 结

source: Kilowatt-hour
de: Kilowatt pro Stunde
zh: 千瓦时

source: Liters per Hour
de: Liter pro Stunde
zh: 升每小时

source: Liters per Minute
de: Liter pro Minute
zh: 升每分钟

source: Liters Per Second
de: Liter pro Sekunde
zh: 升每秒

source: Meters per second
de: Meter pro Sekunde
zh: 米/秒

source: Meters per second per second
de: Meter pro sekunde
zh: 米/秒/秒

source: Milligram per Liter
de: Milligramm pro Liter
zh: 毫克每升

source: Milliamp
de: Milliampere
zh: 毫升

source: Miles per hour
de: Milen pro Stunde
zh: 每小时英里数

source: Cubic meters per kilogram
de: Kubikmeter pro Kilogramm
zh: 每公斤立方米

source: Percent
de: Prozent
zh: 百分

source: PID values
de: PID-Werte
zh: PID值

source: Parts per billion
de: Teile pro Milliarde
zh: 十亿分之一

source: Parts per million
de: Teile pro Million
zh: 百万分之一

source: Parts per thousand
de: Teile pro Tausend
zh: 千分之几

source: Pounds per square inch
de: Pfund pro Quadratzoll
zh: 磅每平方英寸

source: Revolutions per minute
de: Revolutionen pro Minute
zh: 每分钟转数

source: Second
de: Zweite
zh: 第二

source: Steps
de: Schritte
zh: 步骤

source: Microgram per cubic meter
de: Mikrogramm pro Kubikmeter
zh: 每立方米的微克数

source: Microtesla
de: Mikrotesla
zh: 微特斯拉

source: Actions
de: Aktionen
zh: 操作

source: Add
de: Hinzufügen
zh: 加

source: Activate
de: Aktivieren
zh: 启用

source: Alert
de: Warnen
zh: 警报

source: Average
de: Durchschnittlich
zh: 平均

source: Bluetooth MAC (XX:XX:XX:XX:XX:XX)
de: Bluetooth MAC (XX:XX:XX:XX:XX:XX:XX)
zh: 蓝牙 MAC地址（XX:XX:XX:XX:XX:XX)

source: Calibration
de: Kalibrierung
zh: 校准

source: Calculate
de: Berechnung
zh: 计算

source: Camera
de: Kamera
zh: 相机

source: Cancel
de: Stornieren
zh: 取消

source: Clear
de: klar
zh: 明确

source: Commands
de: Befehle

source: Completed
de: Abgeschlossen
zh: 已完成

source: Conditional
de: Bedingungen
zh: 条件

source: Controller
de: Regler
zh: 控制器

source: Create
de: Erstellen
zh: 创建

source: Custom
de: Brauch
zh: 自定义

source: Data
de: Daten
zh: 数据

source: Deactivate
de: Deaktivieren
zh: 停用

source: Default
de: Standard
zh: 默认

source: Delete
de: Löschen
zh: 删除

source: Device
de: Gerät
zh: 设备

source: Diagnostic
de: Diagnose
zh: 诊断

source: Display
de: Anzeige
zh: 显示

source: Down
de: Nach unten
zh: 下

source: Duplicate
de: Duplikat
zh: 副本

source: Edge
de: Kante
zh: 边缘

source: Edit
de: Bearbeiten
zh: 编辑

source: Energy Usage
de: Energieverbrauch
zh: 能源使用

source: Error
de: Fehler
zh: 错误

source: Fail
de: Scheitern
zh: 失败

source: Function
de: Funktion
zh: 功能

source: General
de: Allgemeines
zh: 一般

source: Hold
de: Halt
zh: 保持

source: I2C Address
de: I2C-Adresse
zh: I2C地址

source: Indicator
de: Indikator
zh: 指示符

source: Invert
de: Umkehren
zh: 倒置

source: Input
de: Eingabe
zh: 输入

source: Invalid
de: Ungültig
zh: 无效

source: Last
de: Letzte
zh: 持续

source: Line
de: Linie
zh: 线

source: Lock
de: Schloss
zh: 锁

source: Math
de: Berechnung
zh: 数学

source: Measurement
de: Messwert
zh: 测量

source: Method
de: Verfahrensweise
zh: 方法

source: Modify
de: Ändern
zh: 修改

source: Multiple
de: Mehrere
zh: 多

source: None Available
de: Keine verfügbar
zh: 没有可用

source: Note
de: Hinweis
zh: 注意

source: Off
de: Aus
zh: 关闭

source: On
de: An
zh: 打开

source: Output
de: Ausgabe
zh: 输出

source: Past
de: Vergangenheit
zh: 通过

source: Password
de: Passwort
zh: 密码

source: Pin
de: Stift
zh: 针脚

source: Publish
de: Veröffentlichen
zh: 发布

source: Ramp
de: Rampe
zh: 斜坡

source: Rename
de: Umbenennen
zh: 改名

source: Reorder
de: Aufnahme
zh: 重新排序

source: Resume
de: Fortsetzen
zh: 恢复

source: Save
de: Speichern
zh: 保存

source: Save Order
de: Speichern
zh: 保存订单

source: Scale
de: Skala
zh: 尺寸

source: Unscaled Unit Min
de: Unskalierte Einheit min
zh: 非标定单位最小值

source: Unscaled Unit Max
de: Unskalierte Einheit max
zh: 非标定单位最大值

source: Rescaled Unit Min
de: Neuskalierte Einheit min
zh: 重新调整的单位分钟

source: Rescaled Unit Max
de: Neuskalierte Einheit max
zh: 重新调整的单位最大值

source: Select One
de: Auswählen
zh: 选择一个

source: Sensitivity
de: Empfindlichkeit
zh: 灵敏度

source: Settings
de: Einstellungen
zh: 设置

source: Stops
de: Stop
zh: 停止

source: Success
de: Erfolg
zh: 成功

source: Sum
de: Summe
zh: 和

source: Tag
de: Etikett
zh: 标签

source: Theme
de: Thema
zh: 主题

source: Time-lapse
de: Zeitraffer
zh: 超时

source: Trigger
de: Auslösen
zh: 触发

source: Unlock
de: freischalten
zh: 解锁

source: Up
de: Nach oben
zh: 向上

source: User
de: Benutzer
zh: 用户

source: Value
de: Wert
zh: 值

source: Voltage
de: Spannung
zh: 电压

source: 1-Wire Device ID
de: 1-Wire-Geräte-ID
zh: 1-Wire器件ID

source: Gain
de: Gewinnen
zh: 获得

source: Resolution
de: Entscheidung
zh: 解析度

source: Sample Speed
de: Probegeschwindigkeit
zh: 采样速度

source: The UART baud rate
de: Die UART-Baudrate
zh: UART波特率

source: Command
de: Befehl
zh: 命令

source: The command to be executed
de: Der auszuführende Befehl
zh: 要执行的Python 3代码

source: Select the unit of the measurement to be stored in the database
de: Wählen Sie die Einheit der Messung aus, die in der Datenbank gespeichert werden soll
zh: 选择要存储在数据库中的测量单位

source: Convert to Unit
de: In Einheit umrechnen
zh: 转换为单位

source: Convert the measurement to a different unit
de: Konvertieren Sie die Messung in eine andere Einheit
zh: 将测量值转换为其他单位

source: click to copy to the clipboard
de: Klicken Sie in die Zwischenablage kopieren
zh: 点击复制到剪贴板

source: Seconds
de: Sekunden
zh: 第二

source: Time to wait until failure
de: Zeit zum Warten bis zum Scheitern

source: Duty cycle for the PWM (percent, 0.0 - 100.0)
de: Arbeitszyklus für die PWM (Prozent, 0,0 - 100,0)
zh: PWM的占空比（百分比，0.0 - 100.0）

source: Desired Flow Rate
de: Gewünschte Durchflussmenge
zh: 流量需求

source: Name Font Size (em)
de: Name Schriftgröße (em)
zh: 名称字体大小（EM）

source: The font size of the Name text
de: Die Schriftgröße des Namens Text
zh: 名称文本的字体大小

source: Force Command
de: Kommando erzwingen
zh: 空军指挥

source: Always send the command if instructed, regardless of the current state
de: Senden Sie den Befehl immer, wenn Sie dazu aufgefordert werden, unabhängig vom aktuellen Zustand
zh: 如果指示总是发送命令，不管当前状态

source: FTDI Device
de: FTDI-Gerät
zh: FTDI设备

source: The FTDI device connected to the input/output/etc.
de: Das mit dem Eingang/Ausgang/etc. verbundene FTDI-Gerät.
zh: 连接到输入/输出/等的 FTDI 设备

source: GPIO (using BCM numbering)
de: GPIO (unter Verwendung der BCM-Nummerierung)
zh: GPIO（使用博通自带顺序）

source: Flow Rate Method
de: Durchflussmenge Methode
zh: 流速模式

source: The flow rate to use when pumping a volume
de: Die beim Pumpen eines Volumens zu verwendende Durchflussmenge
zh: 基于抽水量的流速模式

source: Host
de: Anbieter
zh: 主办

source: Host or IP address
de: Host- oder IP-Adresse
zh: 域或IP地址

source: Interface
de: Schnittstelle
zh: 接口

source: The interface used to communicate
de: Die für die Kommunikation verwendete Schnittstelle
zh: 用于通信的接口

source: The user to execute the command
de: Der Benutzer, der den Befehl ausführt
zh: 执行命令的用户

source: Show debug lines in the Daemon Log
de: Zeigen Sie Debug-Linien im Daemon Log
zh: 显示在守护程序日志调试线

source: Max Age
de: Maximales Alter
zh: 最长时间

source: The maximum allowable measurement age
de: Das maximal zulässige Messalter
zh: 最大允许测量时间

source: Unit Measurement
de: Maßeinheit
zh: 单位计量

source: Select a unit for the stored value
de: Wählen Sie eine Einheit für den gespeicherten Wert
zh: 选择存储值的单位

source: Measurements Enabled
de: Messungen aktiviert
zh: 测量已启用

source: The measurements to record
de: Die aufzuzeichnenden Messungen
zh: 测量记录

source: Message Includes Code
de: Nachricht enthält Code
zh: 消息中包含的代码

source: Include the code in the message variable
de: Fügen Sie den Code in die Nachrichtenvariable ein
zh: 包括在消息变量的代码

source: A name to distinguish this from others
de: Ein Name, um dies von anderen zu unterscheiden
zh: 一个名称，以区别于其他人

source: Off Command
de: Aus Befehl
zh: 关闭命令

source: Command to execute when the output is instructed to turn off
de: Auszuführender Befehl, wenn der Ausgang zum Ausschalten angewiesen wird
zh: 指示关闭输出时执行的命令

source: On Command
de: An Befehl
zh: 按命令

source: Command to execute when the output is instructed to turn on
de: Auszuführender Befehl, wenn der Ausgang angewiesen wird, sich einzuschalten
zh: 指示输出打开时执行的命令

source: On State
de: über die staatliche
zh: 触发

source: What state triggers the output to turn on? High or Low?
de: Welcher Status löst die Ausgabe aus? Hoch oder tief?
zh: 什么状态触发输出打开？高还是低？

source: Send to output controller
de: Senden an die Ausgabesteuerung
zh: 发送到输出控制器

source: Period
de: Zeitraum
zh: 租期

source: The duration between measurements or actions
de: Die Dauer zwischen Messungen oder Aktionen

source: Clock
de: Uhr
zh: 时钟

source: Cable Select
de: Kabel auswählen
zh: 通道选择

source: Host port number
de: Host-Portnummer
zh: 主机端口号

source: Pre Out Duration
de: Pre Out Dauer

source: If a Pre Output is selected, set the duration to turn the Pre Output on for before every measurement is acquired.
de: Wenn ein Vorausgang ausgewählt ist, stellen Sie die Dauer ein, für die der Vorausgang eingeschaltet werden soll, bevor jede Messung erfasst wird.

source: Pre During Measure
de: Vormessung
zh: 预测期间

source: Check to turn the output off after (opposed to before) the measurement is complete
de: Aktivieren Sie das Kontrollkästchen, um den Ausgang auszuschalten, nachdem die Messung abgeschlossen ist
zh: 检查在完成测量后（与之前相反）关闭输出

source: Pre Output
de: Vorleistung
zh: 预输出

source: Turn the selected output on before taking every measurement
de: Schalten Sie die ausgewählte Ausgabe vor jeder Messung ein
zh: 在进行每次测量之前，打开所选输出

source: PWM Command
de: PWM Befehl
zh: PWM命令

source: Command to execute to set the PWM duty cycle (%)
de: Auszuführender Befehl zur Einstellung des PWM-Tastverhältnisses (%)
zh: 用于设置 PWM 占空比 (%) 的命令

source: The Hertz to output the PWM signal (0 - 70,000)
de: Der Hertz Wert zur Ausgabe des PWM-Signals (0 - 70.000)
zh: 赫兹输出PWM信号（0 - 70,000）

source: Library
de: Bibliothek
zh: 图书馆

source: Which method to produce the PWM signal (hardware pins can produce higher frequencies)
de: Welche Methode zur Erzeugung des PWM-Signals (Hardware Pins können höhere Frequenzen erzeugen)
zh: 哪种方法可以产生PWM信号（硬件引脚可以产生更高的频率）

source: Reference Resistance
de: Referenzwiderstand
zh: 参考电阻

source: Refresh
de: Auffrischen
zh: 刷新

source: Duration to wait between acquiring new measurements
de: Dauer der Wartezeit zwischen der Erfassung neuer Messungen
zh: 获取任何新测量值之间等待的秒数

source: Measurement resolution
de: Messauflösung
zh: 测量分辨率

source: Pulses Per Rev
de: Impulse pro Umdrehung
zh: 脉冲每转

source: The number of pulses per revolution to calculate revolutions per minute (RPM)
de: Die Anzahl der Impulse pro Umdrehung zur Berechnung der Umdrehungen pro Minute (RPM)
zh: 计算每分钟转数（RPM）的每转脉冲数

source: Sample Time
de: Beispielzeit
zh: 采样时间

source: The duration of time to sample
de: Die Zeitdauer der Probenahme

source: Measurement Unit
de: Maßeinheit
zh: 测量单位

source: Select the measurement and unit to store this measurement in the database
de: Wählen Sie die Messung und Einheit aus, um diese Messung in der Datenbank zu speichern
zh: 选择测量和单位以将此测量值存储在数据库中

source: Setpoint Tracking Type
de: Sollwertnachführung Typ
zh: 定值跟踪类型

source: Select the type of setpoint tracking
de: Wählen Sie die Art der Sollwertverfolgung
zh: 选择设定值跟踪的类型

source: The input voltage to the sensor
de: Die Eingangsspannung zum Sensor
zh: 传感器的输入电压

source: Shutdown Value
de: Shutdown Wert
zh: 关闭值

source: The output value to set when Mycodo shuts down
de: Der Ausgangswert zu setzen, wenn Mycodo Fährt
zh: 产值集时Mycodo关闭

source: The duration to wait before the first operation
de: Die Dauer, die vor der ersten Operation gewartet werden muss

source: Startup Value
de: Startwert
zh: 启动值

source: The output value to set when Mycodo starts up
de: Der Ausgangswert einzustellen, wenn Mycodo startet
zh: 产值集时Mycodo启动

source: Shutdown State
de: Shutdown-Status
zh: 关机状态

source: When Mycodo shuts down, set the output state
de: Wenn Mycodo Fährt, den Ausgangszustand gesetzt
zh: 当Mycodo关闭，设置输出状态

source: Startup State
de: Start Zustand
zh: 开始状态

source: When Mycodo starts, set the output state
de: Wenn Mycodo startet, legen Sie den Ausgabezustand fest
zh: 当Mycodo启动时，设置输出状态

source: Edge detection: low to high (rising), high to low (falling), or both
de: Kantenerkennung: niedrig bis hoch (steigend), hoch bis niedrig (fallend) oder beides
zh: 边沿检测：从低到高（上升），从高到低（下降）或两者兼而有之

source: Bounce Time
de: Prellzeit

source: Milliseconds
de: Millisekunden

source: The amount of time to bounce the input signal
de: Die Zeitspanne, in der das Eingangssignal gebounced wird

source: Reset Period
de: Periode zurücksetzen
zh: 重置期间

source: Wait a period of time after the first edge detection to begin detecting again
de: Warten Sie nach der ersten Flankenerkennung eine gewisse Zeit, um die Erkennung erneut zu starten

source: RTD Probe Type
de: RTD-Sondentyp
zh: RTD探头类型

source: The type of thermocouple connected
de: Der Typ des angeschlossenen Thermoelements
zh: 连接的热电偶类型

source: Times to Check
de: Zu prüfende Zeiten

source: Number of times to check
de: Anzahl der zu überprüfenden Zeiten
zh: 要检查的次数

source: Trigger at Startup
de: Trigger beim Start
zh: 在启动时触发

source: Whether or not to trigger Functions when Mycodo starts
de: Gibt an, ob beim Start von Mycodo Funktionen ausgelöst werden sollen
zh: 是否在Mycodo启动时触发功能

source: UART Device
de: UART-Gerät
zh: UART设备

source: The UART device location (e.g. /dev/ttyUSB1)
de: Der Standort des UART-Geräts (zB / dev / ttyUSB1)
zh: UART设备位置（例如/ dev / ttyUSB1）

source: Analyze Python with Pylint
de: Python Code mit Pylint analysieren

source: Analyze the Python code with pylint and return the output
de: Python Code mit Pylint analysieren und Ergebnis anzeigen

source: Weighting
de: Gewichtung
zh: 权重

source: The weighting of the previous measurement on the current measurement. Range: 0.0 - 1.0. Used for smoothing measurements. 0.0 means no weighting.
de: Die Gewichtung der vorherigen Messung auf die aktuelle Messung. Bereich: 0.0 - 1.0. Wird zum Glätten von Messungen verwendet. 0.0 bedeutet keine Gewichtung.
zh: 前一次测量对当前测量的加权。范围：0.0 - 1.0。用于平滑测量。 0.0表示没有加权。

source: Always Min
de: Immer Min
zh: 总是最小

source: Raise
de: Anheben
zh: 提高

source: Never allow duty cycle to go below Min.
de: Lassen Sie niemals Einschaltdauer unter Min gehen.
zh: 不要让占空比去min以下。

source: Lower
de: Niedriger
zh: 降低

source: Mycodo Environmental Monitoring and Regulation System
de: Mycodo System zur Überwachung und Regulierung der Umwelt
zh: Mycodo环境监测和监管系统

source: Mycodo is open source software designed to run on the [Raspberry Pi](https://en.wikipedia.org/wiki/Raspberry_Pi) and other single-board computers (SBCs). It couples inputs and outputs in interesting ways to sense and manipulate the environment.
de: Mycodo ist eine Open-Source-Software, die auf dem [Raspberry Pi](https://en.wikipedia.org/wiki/Raspberry_Pi) und anderen Einplatinencomputern (SBCs) läuft. Sie verknüpft Ein- und Ausgänge auf interessante Weise, um die Umgebung zu erfassen und zu manipulieren.
zh: Mycodo是开源软件，旨在运行在[树莓派](https://en.wikipedia.org/wiki/Raspberry_Pi)和其他单板计算机(SBC)上。它以有趣的方式将输入和输出耦合起来，以感知和操纵环境。

source: Information
de: Informationen

source: See the [README](https://github.com/kizniche/Mycodo#uses) for features, projects using Mycodo, screenshots, and other information.
de: Siehe die [README](https://github.com/kizniche/Mycodo#uses) für Funktionen, Projekte, die Mycodo verwenden, Screenshots und andere Informationen.
zh: 有关功能、使用Mycodo的项目、屏幕截图和其他信息，请参见[README](https://github.com/kizniche/Mycodo#uses)。

source: Prerequisites
de: Voraussetzungen
zh: 先决条件

source: Single-board computer (Recommended: [Raspberry Pi](https://www.raspberrypi.org/), any version: Zero, 1, 2, 3, or 4)
de: Einplatinencomputer (empfohlen: [Raspberry Pi](https://www.raspberrypi.org/), beliebige Version: Zero, 1, 2, 3, oder 4)
zh: 单板计算机（推荐。[Raspberry Pi](https://www.raspberrypi.org/)，任何版本。零，1，2，3，或4)

source: Debian-based operating system
de: Debian-basiertes Betriebssystem
zh: 基于Debian的操作系统

source: An active internet connection
de: Eine aktive Internetverbindung
zh: 一个活跃的互联网连接

source: Install
de: Installieren Sie
zh: 安装

source: Once booted and logged in, run the following command to initiate the Mycodo install:
de: Sobald Sie hochgefahren und eingeloggt sind, führen Sie den folgenden Befehl aus, um die Installation von Mycodo zu starten:
zh: 启动并登录后，运行以下命令，启动Mycodo安装。

source: After installation, open a web browser to the SBC's IP address and you will be prompted to create an Admin user and login.
de: Öffnen Sie nach der Installation einen Webbrowser mit der IP-Adresse des SBC und Sie werden aufgefordert, einen Admin-Benutzer zu erstellen und sich anzumelden.
zh: 安装后，打开Web浏览器到SBC的IP地址，会提示你创建一个管理员用户并登录。

source: Support
de: Unterstützung

source: Discussion Forum
de: Diskussionsforum
zh: 论坛

source: Frequently Asked Questions
de: Häufig gestellte Fragen
zh: 常见问题

source: Donate
de: Spenden Sie
zh: 捐赠

source: Become a Sponsor
de: Sponsor werden
zh: 成为赞助商

source: Other Methods
de: Andere Methoden

source: Mycodo is an open-source environmental monitoring and regulation system that was built to run on single-board computers, specifically the [Raspberry Pi](https://en.wikipedia.org/wiki/Raspberry_Pi).
de: Mycodo ist ein quelloffenes Umweltüberwachungs- und -regulierungssystem, das für den Betrieb auf Einplatinencomputern, insbesondere dem [Raspberry Pi](https://en.wikipedia.org/wiki/Raspberry_Pi), entwickelt wurde.
zh: Mycodo是一个开源的环境监测和调节系统，它是建立在单板计算机上运行的，特别是 [Raspberry Pi](https://en.wikipedia.org/wiki/Raspberry_Pi)。

source: Originally developed for cultivating edible mushrooms, Mycodo has grown to do much more. The system consists of two parts, a backend (daemon) and a frontend (web server). The backend performs tasks such as acquiring measurements from sensors and devices and coordinating a diverse set of responses to those measurements, including the ability to modulate outputs (switch relays, generate PWM signals, operate pumps, switch wireless outlets, publish/subscribe to MQTT, among others), regulate environmental conditions with PID control, schedule timers, capture photos and stream video, trigger actions when measurements meet certain conditions, and more. The frontend hosts a web interface that enables viewing and configuration from any browser-enabled device.
de: Ursprünglich für die Zucht von Speisepilzen entwickelt, kann Mycodo inzwischen viel mehr. Das System besteht aus zwei Teilen, einem Backend (Daemon) und einem Frontend (Webserver). Das Backend übernimmt Aufgaben wie die Erfassung von Messwerten von Sensoren und Geräten und koordiniert eine Reihe von Reaktionen auf diese Messwerte, einschließlich der Fähigkeit, Ausgänge zu modulieren (Relais schalten, PWM-Signale erzeugen, Pumpen betreiben, drahtlose Ausgänge schalten, MQTT veröffentlichen/abonnieren usw.), Umgebungsbedingungen mit PID-Steuerung zu regulieren, Zeitpläne zu erstellen, Fotos aufzunehmen und Videos zu streamen, Aktionen auszulösen, wenn Messwerte bestimmte Bedingungen erfüllen, und vieles mehr. Das Frontend beherbergt eine Weboberfläche, die Anzeige und Konfiguration von jedem Browser-fähigen Gerät aus ermöglicht.
zh: Mycodo最初是为培养食用菌而开发的，现在已经发展到可以做得更多。该系统由两部分组成，一个后端（守护程序）和一个前端（网络服务器）。后台执行的任务包括从传感器和设备获取测量值，并协调对这些测量值的各种反应，包括调制输出的能力（开关继电器、生成PWM信号、操作泵、开关无线插座、发布/订阅MQTT等）、用PID控制调节环境条件、安排定时器、捕捉照片和视频流、在测量值满足某些条件时触发行动等等。前端有一个网络界面，可以从任何支持浏览器的设备上查看和配置。
