Repository: nonomal/Mycodo
Catalog: mycodo/mycodo_flask/translations/*/LC_MESSAGES/messages.po
Languages: de, zh

source: Different options are available depending on the camera being used.
de: Verschiedene Optionen sind auf der Kamera zur Verfügung, je verwendet werden.
zh: 不同的选择取决于相机上使用是可用的。

source: Name for this Camera
de: Name für diese Kamera
zh: 此相机的名称

source: Linux shell command to execute prior to acquiring a still image.
de: Linux Shell-Befehl vor dem Erfassen eines Standbilds auszuführen.
zh: Linux的外壳命令获取静止图像之前执行。

source: Linux shell command to execute after acquiring a still image.
de: Linux Shell-Befehl nach dem Erfassen eines Standbilds auszuführen.
zh: Linux shell命令来获取静态图像后执行。

source: The duration to keep the output on prior to acquiring a still image. For example, useful for fluorescent lights that take a few seconds to turn on.
de: Die Dauer zu halten, die Ausgabe auf dem Stand der ein Standbild zu gewinnen. Zum Beispiel nützlich für Leuchtstofflampen, die ein paar Sekunden dauern, zu aktivieren.
zh: 的持续时间，以保持输出之前到获取的静止图像。例如，对于需要几秒钟打开荧光灯有用。

source: Path to save still image files. Leave blank to use default location.
de: Pfad zum Speichern von Standbilddateien. Lassen Sie das Feld leer, um den Standardspeicherort zu verwenden.
zh: 保存静止图像文件的路径。留空以使用默认位置。

source: Path to save timelapse image files. Leave blank to use default location.
de: Pfad zum Speichern von Timelapse-Bilddateien. Lassen Sie das Feld leer, um den Standardspeicherort zu verwenden.
zh: 保存timelapse图像文件的路径。留空以使用默认位置。

source: Path to save video files. Leave blank to use default location.
de: Pfad zum Speichern von Videodateien. Lassen Sie das Feld leer, um den Standardspeicherort zu verwenden.
zh: 保存视频文件的路径。留空以使用默认位置。

source: Timelapse Parameters
de: Zeitraffer Parameter
zh: 间隔拍摄参数

source: Generate
de: Erzeugen Sie

source: Last Timelapse
de: Letzter Zeitraffer
zh: 最后一次游戏中

source: Last Still
de: Letzter
zh: 最后还是

source: Drag
de: Ziehen

source: Select a measurement with the unit
de: Wählen Sie eine Messung mit dem Gerät
zh: 选择与该单元的测量

source: Amps
de: Ampere
zh: 安培

source: Past Hour
de: Letzte Stunde
zh: 在过去一小时

source: Past Day
de: Gestern
zh: 过去的一天

source: Past Week
de: Letzte Woche
zh: 上周

source: Past Month
de: Letzter Monat
zh: 过去一个月

source: Amps (Average over period)
de: Ampere (Durchschnitt über den Zeitraum)
zh: 安培（平均超过期）

source: Cost
de: Kosten
zh: 成本

source: From
de: Von
zh: 从

source: Past Year
de: Letztes Jahr
zh: 过去的一年

source: hours
de: Stunden

source: Total
de: Gesamt
zh: 总

source: Functions conduct complex tasks, often coupling one or more <a href="/input">Inputs</a> with <a href="/output">Outputs</a>. For example, this could be using a PID Controller to create a feedback loop with a temperature sensor and heater in order to regulate temperature.
de: Funktionen führen komplexe Aufgaben aus und verknüpfen oft einen oder mehrere <a href="/input">Eingänge</a> mit <a href="/output">Ausgängen</a>. So könnte beispielsweise ein PID-Regler verwendet werden, um eine Rückkopplungsschleife mit einem Temperatursensor und einer Heizung zu erstellen, um die Temperatur zu regeln.

source: Asynchronous Graph
de: Asynchrone Grafik
zh: 异步图

source: Hold down the <kbd>Ctrl</kbd> or <kbd>&#8984;</kbd> key to select more than one
de: Halten Sie die Taste <kbd>Strg</kbd> oder <kbd>&#8984;</kbd> gedrückt, um mehrere auszuwählen
zh: 按住<kbd>Ctrl</kbd>或<kbd>&#8984;</kbd>键选择多个

source: Database Version
de: Datenbankversion
zh: 数据库版本

source: Running
de: Läuft
zh: 运行

source: Not Running
de: Läuft nicht
zh: 没跑

source: Daemon Process ID
de: Daemon Prozess ID
zh: 守护程序进程ID

source: Daemon RAM Usage
de: Daemon-RAM-Nutzung
zh: 守护进程RAM使用情况

source: Daemon Virtualenv
de: Daemon virtuelle Umgebung
zh: 守护进程Virtualenv

source: Yes
de: Ja
zh: 是

source: No
de: Nein
zh: 没有

source: Frontend Process ID
de: Frontend-Prozess-ID

source: Frontend RAM Usage
de: Frontend RAM Nutzung
zh: 前端RAM使用

source: Frontend Virtualenv
de: Frontend virtuelle Umgebung
zh: 前端Virtualenv

source: No Inputs/Functions Activated
de: Keine Eingänge/Funktionen Aktiviert

source: Input (%(type)s), %(sec)s second interval
de: (%(type)s), %(sec)s Sek. Intervall
zh: 输入 (%(type)s)，%(sec)s 秒间隔

source: Timestamp
de: Zeitstempel
zh: 时间戳

source: Please wait
de: Bitte warten
zh: 请稍候

source: Function (%(type)s), %(sec)s second interval
de: Funktion (%(type)s), %(sec)s Sekundenintervall

source: Function (%(type)s)
de: Funktion (%(type)s)

source: Back to Method Management
de: Zurück zum Methoden Managment
zh: 返回方法管理

source: Methods invoked to calculate the value of this method
de: Methoden, die zur Berechnung des Wertes dieser Methode aufgerufen werden

source: Methods allow different types of setpoint tracking in PID controllers. Normally, a PID controller will regulate an environmental condition to a specific setpoint. If you would like the setpoint to change over time, this is called setpoint tracking.
de: Methoden erlauben unterschiedliche Arten der Sollwertverfolgung in PID-Reglern. Normalerweise regelt ein PID-Regler eine Umgebungsbedingung auf einen bestimmten Sollwert. Wenn Sie möchten, dass sich der Sollwert im Laufe der Zeit ändert, wird dies als Sollwertverfolgung bezeichnet.
zh: 方法允许PID控制器中的不同类型的设定点跟踪。通常，PID控制器将环境条件调节到特定的设定点。如果您希望设定值随时间变化，则称为设定点跟踪。

source: No Saved Methods Exist
de: Keine gespeicherten Methoden vorhanden
zh: 没有保存的方法存在

source: Saved Methods
de: Gespeicherte Methoden
zh: 保存的方法

source: Active
de: Aktiv
zh: 活性

source: Inactive
de: Inaktiv
zh: 待用

source: Output devices enable Mycodo to manipulate things through the use of outputs (wired and wireless), PWM signals, and executing commands. When linked to a PID controller, with an input, output devices can be used for feedback regulation.
de: Ausgabegeräte ermöglichen es Mycodo, Dinge durch die Verwendung von Ausgaben (verdrahtet und drahtlos), PWM-Signalen und Ausführen von Befehlen zu manipulieren. Bei Anschluss an einen PID-Regler mit einem Eingang können Ausgabegeräte zur Rückkopplungsregelung verwendet werden.
zh: 输出设备使Mycodo能够通过使用输出（有线和无线），PWM信号和执行命令来操纵事物。当链接到带有输入的PID控制器时，输出设备可用于反馈调节。

source: Unconfigured
de: Nicht konfiguriert
zh: 未配置

source: Manufacturer
de: Hersteller
zh: 生产厂家

source: Literature
de: Literatur

source: Datasheet
de: Datenblatt

source: Product
de: Produkt

source: Additional
de: Zusätzliche

source: Options
de: Optionen

source: Channel Options
de: Kanal-Optionen

source: Send
de: Senden Sie

source: Are you sure you want to do this?
de: Sind Sie sicher, dass Sie das tun wollen?

source: Measurement Settings
de: Messeinstellungen
zh: 测量设置

source: None Found
de: Keine gefunden

source: Address
de: Adresse
zh: 地址

source: Rescale Method
de: Rescale-Methode

source: Rescaled Measurement
de: Neuskalierte Messung
zh: 重新调整测量

source: Do Not Rescale
de: Nicht neu skalieren
zh: 不要重新缩放

source: Do Not Convert
de: Nicht konvertieren
zh: 不要转换

source: Number of measurements
de: Anzahl der Messungen
zh: 测量次数

source: The Python 3 code to execute
de: Der auszuführende Python 3-Code
zh: 要执行的Python 3代码

source: Disabled
de: Deaktiviert
zh: 残

source: The duration between executing the Run Python Code
de: Zeit zwischen den Ausführungen des Python-Code

source: The timeout for the execution of the Run Python Code
de: Die Zeitüberschreitung für die Ausführung des Befehls Python-Code ausführen

source: Conditions
de: Bedingungen
zh: 条件

source: Condition
de: Bedingung
zh: 条件

source: Activated Status
de: Status An/Aus

source: Paused
de: Pausiert
zh: 已暂停

source: On Hold
de: In Wartestellung
zh: 等候接听

source: Select the measurement to use as the input
de: Wählen Sie die Messung aus, die als Eingabe verwendet werden soll
zh: 选择要用作输入的测量

source: Choose the direction(s) to regulate
de: Wählen Sie die Richtung(en) zum Regeln
zh: 选择要调节的方向

source: This is the desired state of a perticular environmental condition. For instance, this could be the desired temperature in Celsius.
de: Dies ist der gewünschte Zustand einer bestimmten Umgebungsbedingung. Zum Beispiel könnte dies die gewünschte Temperatur in Celsius sein.
zh: 这是特定环境条件的理想状态。例如，这可能是摄氏温度。

source: The control hysteresis surounding the setpoint, with a band that is the setpoint plus and minus the band value. 0 is disabled.
de: Die Regelhysterese umgibt den Sollwert, mit einem Band, das den Sollwert plus und minus dem Bandwert darstellt. 0 ist deaktiviert.
zh: 控制滞后超出设定值，带宽为设定值加上和减去带宽值。 0被禁用。

source: Proportional gain
de: Propotionaler Anstieg
zh: 比例增益

source: Integral gain
de: Integraler Anstieg
zh: 积分增益

source: Derivative gain
de: Derivativer Anstieg
zh: 衍生收益

source: Limit the integrator minimum, for calculating Ki_total: (Ki_total = Ki * integrator; and PID output = Kp_total + Ki_total + Kd_total)
de: Begrenzen Sie das Integratorminimum, um Ki_total zu berechnen: (Ki_total = Ki * integrator; und PID output = Kp_total + Ki_total + Kd_total)
zh: 限制积分器最小值，用于计算Ki_total：（Ki_total = Ki *积分器; PID输出= Kp_total + Ki_total + Kd_total）

source: Limit the integrator maximum, for calculating Ki_total: (Ki_total = Ki * integrator; and PID output = Kp_total + Ki_total + Kd_total)
de: Begrenzen Sie das Integratormaximum, um Ki_total zu berechnen: (Ki_total = Ki * Integrator; und PID Ausgabe = Kp_total + Ki_total+ Kd_total)
zh: 限制积分器最大值，用于计算Ki_total：（Ki_total = Ki *积分器; PID输出= Kp_total + Ki_total + Kd_total）

source: The output that will raise the selected environmental condition (Measurement)
de: Der Ausgang, der die ausgewählte Umweltbedingung (Messung) auslöst

source: The output action (on/off, PWM, value, volume, etc.)
de: Aktion des Ausgangs (ein/aus, PWM, Wert, Lautstärke usw.)

source: The output that will lower the selected environmental condition (Measurement)
de: Der Ausgang, der die ausgewählte Umgebungsbedingung senkt (Messung)

source: The output action (on/off, PWM, volume, etc.)
de: Aktion des Ausgangs (ein/aus, PWM, Lautstärke usw.)

source: Select one for calculating the setpoint. When enabled, measurements override the PID setpoint.
de: Wählen Sie für eine den Sollwert zu berechnen. Wenn diese Funktion aktiviert, Messungen des PID-Sollwert außer Kraft setzen.
zh: 选择一个计算设定。当启用时，测量覆盖PID设定值。

source: Invalid saved ID. Save another from this list.
de: Ungültige gespeicherte ID. Speichern Sie eine andere aus dieser Liste.
zh: 无效的保存ID。从这个名单拯救他人。

source: Manage Methods
de: Methoden verwalten
zh: 管理方法

source: Maximum allowable measurement age
de: Maximal zulässige Messalter
zh: 最大允许测量年龄

source: Controller Running
de: Controller Lauf
zh: 控制器上运行

source: returns True if the controller is running, False if not.
de: True zurück, wenn der Controller ausgeführt wird, False, wenn nicht.
zh: 如果控制器正在运行，否则为False返回True。

source: Select a Controller to get information about
de: Wählen Sie einen Controller, um Informationen über
zh: 选择一个控制器，以获取有关信息

source: returns True if the GPIO pin is HIGH and False if the GPIO pin is LOW. Do not use this for getting the state of an On/Off GPIO Output (if you do, it will change the GPIO Pin from OUTPUT to INPUT and stop it from working as an Output). Use the Output State Conditional to get the state of the Output.
de: Gibt "True" zurück wenn der GPIO Pin auf High ist in False wenn er auf Low ist. Nicht zur Abfrage An/Aus eines Ausgangs geeignet (Das würde dazu führen dass der Pin zu einem Eingangs-Pin konveriert wird). Um den Status eines Ausgangs abzufragen ist die "Output State" bedingung zu verwenden.

source: Set a GPIO pin to get the state of
de: GPIO Pin eintragen dessen status abgefragt werden soll

source: returns the last value found within the Max Age, otherwise returns None.
de: Rückkehr fand der letzte Wert in dem Max-Alter, sonst keine zurückgibt.
zh: 返回最后一个值的最大年龄内发现的，否则返回无。

source: Do not accept measurements older than this age
de: Akzeptieren Sie keine Messungen älter als dieses Alter
zh: 不接受超过此年龄的测量值

source: returns a list of dictionaries with "time" and "value" key pairs found within the Max Age, otherwise returns None.
de: gibt eine Liste von Wörterbuch mit „Zeit“ und „Wert“ Schlüsselpaar gefunden in dem Max-Alter, gibt sonst keine.
zh: 返回字典的与“时间”和“值”列表中的密钥对的最大年龄内发现的，否则返回无。

source: Example
de: Beispiel
zh: 例

source: returns the average of the values found within the Max Age, otherwise returns None.
de: Gibt den Durchschnitt der in der Max-Age gefundenen Werte, gibt sonst keine.
zh: 返回平均年龄最大内找到的值，否则返回无。

source: returns the sum of the values found within the Max Age, otherwise returns None.
de: kehrt die Summe der innerhalb der Max-Age gefundenen Werte, gibt sonst keine.
zh: 返回最大年龄中发现的值的总和，否则返回无。

source: Output Duration On
de: Output Dauer auf
zh: 输出持续时间在

source: returns how long the output has currently been on, in seconds, or 0 if off.
de: kehrt, wie lange der Ausgang zur Zeit gewesen auf, in Sekunden oder 0, wenn ausgeschaltet.
zh: 返回多久输出当前已被上，在几秒钟内，或0，如果关闭。

source: Select a Output to get information about
de: Wählen Sie eine Ausgabe, um Informationen über
zh: 选择一个输出，以获取有关信息

source: Output State
de: Ausgangszustand
zh: 输出状态

source: returns "on" if the output is on, "off" if the output is off, or a duty cycle value if the Output is PWM.
de: Gibt „on“ zurück, wenn der Ausgang eingeschaltet ist und „off“, wenn der Ausgang ausgeschaltet ist.

source: Select an Output to get the state of
de: Ausgang eintragen dessen status abgefragt werden soll

source: The minimum duration (in seconds) required for the Lower Output to activate. If an On duration is below this value, the Lower Output will not turn on.
de: Die Mindestdauer (in Sekunden), die für die Aktivierung des unteren Ausgangs erforderlich ist. Wenn eine Einschaltdauer unter diesem Wert liegt, wird der untere Ausgang nicht eingeschaltet.
zh: 下限输出激活所需的最短持续时间（以秒为单位）。如果On持续时间低于此值，则Lower Output将不会打开。

source: The maximum duration (in seconds) allowed for the Lower Output to be on for, per period. If an ON duration is above this value, the Lower Output will turn on for this set duration. 0 is disabled.
de: Die maximale Dauer (in Sekunden), für die der untere Ausgang pro Periode eingeschaltet sein darf. Wenn die Einschaltdauer über diesem Wert liegt, wird der untere Ausgang für die eingestellte Dauer eingeschaltet. 0 ist deaktiviert.

source: This output will remain off for at least this duration of time
de: Dieser Ausgang bleibt für mindestens diese Zeitdauer ausgeschaltet
zh: 此输出将至少在此持续时间内保持关闭状态

source: The minimum duration (in seconds) required for the Raise Output to activate. If an On duration is below this value, the Raise Output will not turn on.
de: Die Mindestdauer (in Sekunden), die für die Aktivierung der Erhöhungs-Ausgabe erforderlich ist. Wenn eine Einschaltdauer unter diesem Wert liegt, wird der Erhöhungs-Ausgang nicht eingeschaltet.
zh: 提升输出激活所需的最短持续时间（以秒为单位）。如果“开启”持续时间低于此值，则“提升输出”将不会打开。

source: The maximum duration (in seconds) allowed for the Raise Output to be on for, per period. If an On duration is above this value, the Raise Output will turn on for this set duration. 0 is disabled.
de: Die maximale Dauer (in Sekunden), für die der untere Ausgang pro Periode eingeschaltet sein darf. Wenn die Einschaltdauer über diesem Wert liegt, wird der untere Ausgang für die eingestellte Dauer eingeschaltet. 0 ist deaktiviert.

source: The minimum duty cycle (in %%). If a duty cycle is below this value, this is the value that will be used.
de: Der Mindest-Auslastungsgrad (in %%). Wenn ein Auslastungsgrad unter diesem Wert liegt, ist dies der Wert, der verwendet wird.
zh: 最小占空比（以 %%). 如果占空比低于此值，则这是将使用的值。

source: The maximum duty cycle (in %%). If a duty cycle is below this value, this is the value that will be used.
de: Die maximale Auslastung (in %%). Wenn die Auslastung unter diesem Wert liegt, ist dies der Wert, der verwendet wird.
zh: 最大占空比（以 %%). 如果占空比低于此值，则这是将使用的值。

source: The maximum duty cycle (in %%). If a duty cycle is above this value, this is the value that will be used.
de: Die maximale Auslastung (in %%). Wenn die Auslastung unter diesem Wert liegt, ist dies der Wert, der verwendet wird.
zh: 最大占空比（以 %%). 如果占空比高于此值，则这是将使用的值。

source: The minimum value required for the Lower Output to activate. If the value is below this value, the Lower Output will not turn on.
de: Der Mindestwert, der erforderlich ist, damit der untere Ausgang aktiviert wird. Wenn der Wert unter diesem Wert liegt, wird der untere Ausgang nicht aktiviert.

source: The maximum value allowed for the Lower Output to be on for, per period. If a value is above this value, the Lower Output will turn on for this amount. 0 is disabled.
de: Der maximale Wert, für den der untere Ausgang pro Periode eingeschaltet sein darf. Wenn ein Wert über diesem Wert liegt, wird der untere Ausgang für diesen Zeitraum eingeschaltet. 0 ist deaktiviert.

source: The minimum value required for the Raise Output to activate. If the value is below this value, the Raise Output will not turn on.
de: Der Mindestwert, der erforderlich ist, damit der Ausgang "Anheben" aktiviert wird. Liegt der Wert unter diesem Wert, wird der Ausgang "Anheben" nicht aktiviert.

source: The maximum value allowed for the Raise Output to be on for, per period. If a value is above this value, the Raise Output will turn on for this amount. 0 is disabled.
de: Der maximale Wert, für den der Erhöhungsausgang pro Periode eingeschaltet sein darf. Wenn ein Wert über diesem Wert liegt, wird der Ausgang "Erhöhen" für diesen Betrag eingeschaltet. 0 ist deaktiviert.

source: The minimum volume required for the Lower Output to activate. If the volume is below this value, the Lower Output will not turn on.
de: Die Mindestlautstärke, die erforderlich ist, damit der untere Ausgang aktiviert wird. Wenn die Lautstärke unter diesem Wert liegt, wird der untere Ausgang nicht aktiviert.

source: The maximum volume allowed for the Lower Output to be on for, per period. If a volume is above this value, the Lower Output will turn on for this amount. 0 is disabled.
de: Die maximale Lautstärke, für die der untere Ausgang pro Periode eingeschaltet sein darf. Liegt die Lautstärke über diesem Wert, schaltet sich der untere Ausgang für diesen Zeitraum ein. 0 ist deaktiviert.

source: The minimum volume required for the Raise Output to activate. If the volume is below this value, the Raise Output will not turn on.
de: Die Mindestlautstärke, die erforderlich ist, damit der Ausgang "Erhöhen" aktiviert wird. Liegt die Lautstärke unter diesem Wert, wird der Ausgang "Erhöhen" nicht aktiviert.

source: The maximum volume allowed for the Raise Output to be on for, per period. If a volume is above this value, the Raise Output will turn on for this amount. 0 is disabled.
de: Die maximale Lautstärke, für die der Erhöhungsausgang pro Periode eingeschaltet sein darf. Wenn die Lautstärke über diesem Wert liegt, wird der Erhöhungsausgang für diesen Betrag eingeschaltet. 0 ist deaktiviert.

source: Detect low to high (rising), high to low (falling), or both?
de: Erkennen niedrig zu hoch (steigend), hoch zu niedrig (fallend) oder beides?
zh: 检测从低到高（上升），从高到低（下降）还是两者都检测？

source: Rising
de: Steigend
zh: 升起

source: Falling
de: Fallend
zh: 落下

source: Trigger this conditional to act when this output turns on or off
de: Aktivieren Sie diese Bedingung, um zu reagieren, wenn diese Ausgabe ein- oder ausgeschaltet wird
zh: 触发此条件以在此输出打开或关闭时执行

source: What action will trigger this conditional, on or off?
de: Durch welche Aktion wird diese Bedingung ausgelöst, an oder aus?

source: no duration
de: keine Dauer
zh: 没有持续时间

source: any duration
de: jede Dauer
zh: 任何持续时间

source: no or any duration
de: keine oder irgendeine Dauer
zh: 没有或任何持续时间

source: equal to duration
de: gleich der Dauer
zh: 等于持续时间

source: greater than duration
de: länger als die Dauer
zh: 大于持续时间

source: greater than or equal to duration
de: größer oder gleich der Dauer
zh: 大于或等于持续时间

source: less than duration
de: weniger als die Dauer
zh: 少于持续时间

source: less than or equal to duration
de: weniger als oder gleich Dauer
zh: 小于或等于持续时间

source: (Optional) Set this to a specific duration of time if the conditional should trigger when the output On duration equals this amount
de: (Optional) Stellen Sie dies auf eine bestimmte Zeitdauer ein, wenn die Bedingung ausgelöst werden soll, wenn die Ausgabe EIN-Dauer diesem Betrag entspricht
zh: （可选）如果条件应在输出开启持续时间等于此数量时触发，则将此值设置为特定的持续时间

source: The conditional is triggered when the measured condition is greater than or less than the set value, or the measurement timestamp is greater than the value of seconds
de: Die Bedingung wird ausgelöst, wenn die gemessene Bedingung größer oder kleiner als der eingestellte Wert ist oder der Zeitstempel der Messung größer als der Wert von Sekunden ist
zh: 当测量条件大于或小于设定值或测量时间戳大于秒值时触发条件

source: Greater Than (>)
de: Größer als (>)
zh: 大于（>）

source: Less Than (<)
de: Kleiner als (<)
zh: 小于（<）

source: Equal To (=)
de: Gleich (=)
zh: 等于（=）

source: The duty cycle of the output to be checked
de: Auslastungsgrad des zu überprüfenden Ausgangs
zh: 要检查的输出的占空比

source: Run this duration method, using the output value to set the Duty Cycle of a PWM output
de: Führen Sie diese Dauermethode aus und verwenden Sie den Ausgangswert, um das Tastverhältnis eines PWM-Ausgangs einzustellen
zh: 运行此持续时间方法，使用输出值设置PWM输出的占空比

source: Apply the Duty Cycle to this PWM Output
de: Wenden Sie den Auslastungsgrad auf diesen PWM-Ausgang an
zh: 将占空比应用于此PWM输出

source: The duration between calculating and setting the Duty Cycle of the the PWM Output
de: Die Dauer zwischen dem Berechnen und Einstellen des Auslastungsgrades des PWM-Ausgangs
zh: 计算和设置PWM输出的占空比之间的持续时间

source: Trigger conditional at sunrise or sunset?
de: Auslöser bedingt bei Sonnenaufgang oder Sonnenuntergang?
zh: 在日出或日落时触发条件？

source: Sunrise
de: Sonnenaufgang
zh: 日出

source: Sunset
de: Sonnenuntergang
zh: 日落

source: Latitude for sunrise or sunset
de: Breitengrad für Sonnenaufgang oder Sonnenuntergang
zh: 纬度为日出或日落

source: Longitude for sunrise or sunset
de: Längengrad für Sonnenaufgang oder Sonnenuntergang
zh: 经度为日出或日落

source: The number of days to offset from the date of the sunrise or sunset
de: Die Anzahl der Tage, die vom Datum des Sonnenaufgangs oder Sonnenuntergangs abweichen sollen
zh: 从日出或日落之日起抵消的天数

source: The number of minutes to offset from the sunrise or sunset
de: Die Anzahl der Minuten, die vom Sonnenaufgang oder Sonnenuntergang entfernt werden sollen
zh: 从日出或日落偏移的分钟数

source: The duration between executing the Actions
de: Die Zeit zwischen dem Ausführen der Aktionen

source: Trigger conditional actions at an interval of time
de: Auslösen bedingter Aktionen in einem Zeitintervall
zh: 以一段时间触发条件操作

source: A duration to wait before beginning the timer
de: Eine Wartezeit bis zum Beginn des Timers
zh: 在开始计时器之前等待的持续时间

source: Combine output of multiple methods. All listed methods run in parallel and their outputs are multiplied. The combined method ends when one of cascaded method ends.
de: Kombinieren Sie die Ausgabe mehrerer Methoden. Alle aufgeführten Methoden laufen parallel und ihre Ausgaben werden multipliziert. Die kombinierte Methode endet, wenn eine der kaskadierten Methoden endet.

source: Define the setpoint over a period of time based on specific times of the day. This method will repeat daily. Start the first entry at midnight (00:00) if you wish to fill the entire day.
de: Definieren Sie den Sollwert über einen bestimmten Zeitraum zu bestimmten Tageszeiten. Diese Methode wird täglich wiederholt. Beginnen Sie den ersten Eintrag um Mitternacht (00:00), wenn Sie den ganzen Tag füllen möchten.
zh: 根据一天中的特定时间定义一段时间内的设定值。这种方法每天都会重复。如果您希望填写整天，请在午夜（00:00）开始第一个条目。
