Repository: nonomal/Mycodo
Catalog: mycodo/mycodo_flask/translations/*/LC_MESSAGES/messages.po
Languages: de, zh

source: There are a number of different uses for Mycodo. Some users simply store sensor measurements to monitor conditions remotely, others regulate the environmental conditions of a physical space, while others capture motion-activated or time-lapse photography, among other uses.
de: Für Mycodo gibt es eine Reihe von unterschiedlichen Verwendungszwecken. Einige Nutzer speichern einfach Sensormessungen, um die Bedingungen aus der Ferne zu überwachen, andere regulieren die Umgebungsbedingungen eines physischen Raums, während andere unter anderem bewegungsaktivierte oder Zeitrafferaufnahmen machen.
zh: Mycodo有许多不同的用途。一些用户只是简单地存储传感器的测量值，以远程监控条件，其他用户则是调节物理空间的环境条件，而其他用户则是捕捉运动激活或延时摄影，以及其他用途。

source: Input controllers acquire measurements and store them in the InfluxDB time series database. Measurements typically come from sensors, but may also be configured to use the return value of Linux Bash or Python commands, or math equations, making this a very dynamic system for acquiring and generating data.
de: Input-Controller erfassen Messwerte und speichern sie in der InfluxDB-Zeitreihendatenbank. Die Messungen stammen in der Regel von Sensoren, können aber auch so konfiguriert werden, dass sie den Rückgabewert von Linux-Bash- oder Python-Befehlen oder mathematische Gleichungen verwenden, was dieses System zu einem sehr dynamischen System für die Erfassung und Erzeugung von Daten macht.
zh: 输入控制器获取测量值并将其存储在InfluxDB时间序列数据库中。测量值通常来自传感器，但也可能被配置为使用Linux Bash或Python命令的返回值，或数学方程，这使得这是一个非常动态的获取和生成数据的系统。

source: Output controllers produce changes to the general input/output (GPIO) pins or may be configured to execute Linux Bash or Python commands, enabling a variety of potential uses. There are a few different types of outputs: simple switching of GPIO pins (HIGH/LOW), generating pulse-width modulated (PWM) signals, controlling peristaltic pumps, MQTT publishing, and more.
de: Ausgangssteuerungen erzeugen Änderungen an den GPIO-Pins (GPIO = General Input/Output) oder können so konfiguriert werden, dass sie Linux-Bash- oder Python-Befehle ausführen, was eine Vielzahl von Verwendungsmöglichkeiten bietet. Es gibt einige verschiedene Arten von Ausgängen: einfaches Schalten von GPIO-Pins (HIGH/LOW), Erzeugen von pulsweitenmodulierten (PWM) Signalen, Steuern von Schlauchpumpen, MQTT-Veröffentlichung und mehr.
zh: 输出控制器对通用输入/输出（GPIO）引脚产生变化，或者可以配置为执行Linux Bash或Python命令，实现各种潜在用途。有几种不同类型的输出：GPIO引脚的简单开关（高/低），产生脉宽调制（PWM）信号，控制蠕动泵，MQTT发布，等等。

source: When Inputs and Outputs are combined, Function controllers may be used to create feedback loops that uses the Output device to modulate an environmental condition the Input measures. Certain Inputs may be coupled with certain Outputs to create a variety of different control and regulation applications. Beyond simple regulation, Methods may be used to create a changing setpoint over time, enabling such things as thermal cyclers, reflow ovens, environmental simulation for terrariums, food and beverage fermentation or curing, and cooking food ([sous-vide](https://en.wikipedia.org/wiki/Sous-vide)), to name a few.
de: Wenn Eingänge und Ausgänge kombiniert werden, können Funktionsregler verwendet werden, um Rückkopplungsschleifen zu erstellen, die das Ausgangsgerät verwenden, um einen Umgebungszustand zu modulieren, den der Eingang misst. Bestimmte Eingänge können mit bestimmten Ausgängen gekoppelt werden, um eine Vielzahl verschiedener Steuerungs- und Regelungsanwendungen zu schaffen. Über die einfache Regelung hinaus können Methoden verwendet werden, um einen sich im Laufe der Zeit ändernden Sollwert zu erzeugen, was z. B. Thermocycler, Reflow-Öfen, Umweltsimulationen für Terrarien, Fermentierung oder Reifung von Lebensmitteln und Getränken sowie das Garen von Lebensmitteln ([Sous-vide](https://en.wikipedia.org/wiki/Sous-vide)) ermöglicht, um nur einige Beispiele zu nennen.
zh: 当输入和输出相结合时，功能控制器可用于创建反馈回路，使用输出设备来调节输入所测量的环境条件。某些输入可以与某些输出结合，以创造各种不同的控制和调节应用。除了简单的调节，方法可用于创建一个随时间变化的设定点，实现诸如热循环器、回流炉、饲养箱的环境模拟、食品和饮料的发酵或腌制，以及烹饪食物（[苏式蒸煮](https://en.wikipedia.org/wiki/Sous-vide)），仅举几例。

source: Triggers can be set to activate events based on specific dates and times, according to durations of time, or the sunrise/sunset at a specific latitude and longitude.
de: Auslöser können so eingestellt werden, dass sie Ereignisse auf der Grundlage bestimmter Daten und Uhrzeiten, Zeitspannen oder des Sonnenaufgangs/Sonnenuntergangs an einem bestimmten Breiten- und Längengrad aktivieren.
zh: 触发器可以被设置为根据特定的日期和时间，根据时间的长短，或特定经纬度的日出/日落来激活事件。

source: Live Measurements
de: Live Messungen
zh: 实时测量

source: The `Live Measurements` page is the first page a user sees after logging in to Mycodo. It will display the current measurements being acquired from Input and Function controllers. If there is nothing displayed on the `Live` page, ensure an Input or Function controller is both configured correctly and activated. Data will be automatically updated on the page from the measurement database.
de: Die Seite "Live-Messungen" ist die erste Seite, die ein Benutzer nach dem Einloggen in Mycodo sieht. Sie zeigt die aktuellen Messungen an, die von Eingangs- und Funktionscontrollern erfasst werden. Wenn auf der Seite "Live" nichts angezeigt wird, vergewissern Sie sich, dass ein Eingangs- oder Funktionsregler korrekt konfiguriert und aktiviert ist. Die Daten werden auf der Seite automatisch aus der Messdatenbank aktualisiert.
zh: 实时测量 "页面是用户登录Mycodo后看到的第一个页面。它将显示当前从输入和功能控制器获得的测量结果。如果 "实时 "页面上没有显示，请确保输入或功能控制器配置正确并被激活。数据将从测量数据库中自动更新到该页面上。

source: Asynchronous Graphs
de: Asynchrone Diagramme
zh: 异步

source: Page
de: Seite

source: A graphical data display that is useful for viewing data sets spanning relatively long periods of time (weeks/months/years), which could be very data- and processor-intensive to view as a Synchronous Graph. Select a time frame and data will be loaded from that time span, if it exists. The first view will be of the entire selected data set. For every view/zoom, 700 data points will be loaded. If there are more than 700 data points recorded for the time span selected, 700 points will be created from an averaging of the points in that time span. This enables much less data to be used to navigate a large data set. For instance, 4 months of data may be 10 megabytes if all of it were downloaded. However, when viewing a 4 month span, it's not possible to see every data point of that 10 megabytes, and aggregating of points is inevitable. With asynchronous loading of data, you only download what you see. So, instead of downloading 10 megabytes every graph load, only ~50kb will be downloaded until a new zoom level is selected, at which time only another ~50kb is downloaded.
de: Eine grafische Datenanzeige, die für die Anzeige von Datensätzen über relativ lange Zeiträume (Wochen/Monate/Jahre) nützlich ist, deren Anzeige als Synchrondiagramm sehr daten- und prozessorintensiv sein könnte. Wählen Sie einen Zeitraum aus, und die Daten werden aus dieser Zeitspanne geladen, sofern sie vorhanden sind. In der ersten Ansicht wird der gesamte ausgewählte Datensatz angezeigt. Für jede Ansicht/Zoom werden 700 Datenpunkte geladen. Wenn mehr als 700 Datenpunkte für die ausgewählte Zeitspanne aufgezeichnet wurden, werden 700 Punkte aus einer Mittelung der Punkte in dieser Zeitspanne erstellt. Auf diese Weise können viel weniger Daten verwendet werden, um durch einen großen Datensatz zu navigieren. So können beispielsweise 4 Monate an Daten 10 Megabyte umfassen, wenn sie vollständig heruntergeladen werden. Bei der Betrachtung einer 4-monatigen Zeitspanne ist es jedoch nicht möglich, jeden Datenpunkt dieser 10 Megabyte zu sehen, und eine Aggregation der Punkte ist unvermeidlich. Beim asynchronen Laden von Daten laden Sie nur das herunter, was Sie sehen. Anstatt also bei jedem Laden des Diagramms 10 Megabyte herunterzuladen, werden nur ~50kb heruntergeladen, bis eine neue Vergrößerungsstufe ausgewählt wird, woraufhin nur weitere ~50kb heruntergeladen werden.
zh: 一种图形化的数据显示，对于查看跨度相对较长的时间段（周/月/年）的数据集很有用，如果以同步图的形式查看，可能会非常耗费数据和处理器。选择一个时间框架，如果存在的话，数据将从该时间段加载。第一个视图将是整个选定的数据集。对于每个视图/缩放，700个数据点将被加载。如果所选的时间跨度有超过700个数据点，700个点将从该时间跨度的点的平均数中产生。这样就可以用少得多的数据来浏览一个大的数据集。例如，如果全部下载，4个月的数据可能是10兆字节。然而，当查看4个月的时间跨度时，不可能看到这10兆字节的每一个数据点，点的聚集是不可避免的。通过数据的异步加载，你只下载你所看到的东西。因此，每次加载图表都要下载10兆字节的数据，而在选择新的缩放级别之前，只下载约50kb的数据，这时又只下载约50kb的数据。

source: Graphs require measurements, therefore at least one Input/Output/Function/etc. needs to be added and activated in order to display data.
de: Diagramme erfordern Messungen, daher muss mindestens ein Eingang/Ausgang/Funktion/etc. hinzugefügt und aktiviert werden, um Daten anzuzeigen.

source: The dashboard can be used for both viewing data and manipulating the system, thanks to the numerous dashboard widgets available. Multiple dashboards can be created as well as locked to prevent changing the arrangement.
de: Dank der zahlreichen Dashboard-Widgets kann das Dashboard sowohl zur Anzeige von Daten als auch zur Manipulation des Systems verwendet werden. Es können mehrere Dashboards erstellt und gesperrt werden, um eine Änderung der Anordnung zu verhindern.
zh: 由于有许多仪表盘部件可用，仪表盘既可用于查看数据，也可用于操纵系统。可以创建多个仪表盘，也可以锁定以防止改变安排。

source: Widgets are elements on the Dashboard that have a number of uses, such as viewing data (charts, indicators, gauges, etc.) or interacting with the system (manipulate outputs, change PWM duty cycle, querying or modifying a database, etc.). Widgets can be easily rearranged and resized by dragging and dropping. For a full list of supported Widgets, see [Supported Widgets](Supported-Widgets.md).
de: Widgets sind Elemente auf dem Dashboard, die für verschiedene Zwecke verwendet werden können, z. B. zur Anzeige von Daten (Diagramme, Indikatoren, Messgeräte usw.) oder zur Interaktion mit dem System (Manipulation von Ausgängen, Änderung des PWM-Tastverhältnisses, Abfrage oder Änderung einer Datenbank usw.). Widgets lassen sich durch Ziehen und Ablegen leicht neu anordnen und in der Größe verändern. Eine vollständige Liste der unterstützten Widgets finden Sie unter [Unterstützte Widgets](Supported-Widgets.md).
zh: 部件是仪表板上的元素，有多种用途，如查看数据（图表、指标、仪表等）或与系统互动（操纵输出、改变PWM占空比、查询或修改数据库等）。小工具可以通过拖放轻松地重新安排和调整大小。关于支持的Widgets的完整列表，见[支持的[Widgets](Supported-Widgets.md)。

source: Custom Widgets
de: Benutzerdefinierte Widgets

source: There is a Custom Widget import system in Mycodo that allows user-created Widgets to be used in the Mycodo system. Custom Widgets can be uploaded on the `[Gear Icon] -> Configure -> Custom Widgets` page. After import, they will be available to use on the `Setup -> Widget` page.
de: In Mycodo gibt es ein System für den Import benutzerdefinierter Widgets, mit dem vom Benutzer erstellte Widgets im Mycodo-System verwendet werden können. Benutzerdefinierte Widgets können auf der Seite `[Zahnradsymbol] -> Konfigurieren -> Benutzerdefinierte Widgets` hochgeladen werden. Nach dem Import können sie auf der Seite "Einstellungen -> Widgets" verwendet werden.

source: If you develop a working module, please consider [creating a new GitHub issue](https://github.com/kizniche/Mycodo/issues/new?assignees=&labels=&template=feature-request.md&title=New%20Module) or pull request, and it may be included in the built-in set.
de: Wenn Sie ein funktionierendes Modul entwickeln, ziehen Sie bitte in Erwägung, [ein neues GitHub-Problem zu erstellen](https://github.com/kizniche/Mycodo/issues/new?assignees=&labels=&template=feature-request.md&title=New%20Module) oder einen Pull-Request zu stellen, damit es in das integrierte Set aufgenommen werden kann.

source: Open any of the built-in Widget modules located in the directory [Mycodo/mycodo/widgets](https://github.com/kizniche/Mycodo/tree/master/mycodo/widgets/) for examples of the proper formatting. There are also example Custom Widgets in the directory [Mycodo/mycodo/widgets/examples](https://github.com/kizniche/Mycodo/tree/master/mycodo/widgets/examples).
de: Öffnen Sie eines der integrierten Widget-Module im Verzeichnis [Mycodo/mycodo/widgets](https://github.com/kizniche/Mycodo/tree/master/mycodo/widgets/), um Beispiele für die richtige Formatierung zu sehen. Es gibt auch Beispiele für benutzerdefinierte Widgets im Verzeichnis [Mycodo/mycodo/widgets/examples](https://github.com/kizniche/Mycodo/tree/master/mycodo/widgets/examples).

source: Creating a custom widget module often requires specific placement and execution of Javascript. Several variables were created in each module to address this, and follow the following brief structure of the dashboard page that would be generated with multiple widgets being displayed.
de: Die Erstellung eines benutzerdefinierten Widget-Moduls erfordert oft eine spezielle Platzierung und Ausführung von Javascript. Um dies zu berücksichtigen, wurden in jedem Modul mehrere Variablen erstellt, die der folgenden kurzen Struktur der Dashboard-Seite folgen, die mit mehreren angezeigten Widgets erstellt würde.

source: Flow Meter
de: Durchflussmesser
zh: 流量计

source: Clear Total
de: Gesamt löschen
zh: 净总计

source: Execute
de: Ausführen
zh: 执行

source: Execute a Linux bash shell command.
de: Führen Sie einen Linux-Shell-Befehl.

source: Activate a controller.
de: Aktivieren Sie einen Controller.
zh: 激活控制器。

source: Deactivate a controller.
de: Deaktivieren Sie einen Controller.
zh: 停用的控制器。

source: Create a log line in the daemon log.
de: Log erzeugen im Daemon Log
zh: 显示在守护程序日志调试线.

source: Create a note with the selected Tag.
de: Erstellen Sie eine Notiz mit dem ausgewählten Tag.
zh: 创建与所选标签的说明。

source: Tags
de: Stichworte
zh: 标签

source: Backlight
de: Hintergrundbeleuchtung
zh: 背光灯

source: Flashing
de: Blinkend
zh: 闪存

source: Force Measurements
de: Kraft-Messungen

source: Force measurements to be conducted for an input
de: Erzwinge Messung am Eingangskanal
zh: 要对输入进行测力

source: Equation
de: Gleichung
zh: 方程

source: Keep Alive
de: Bleib am Leben
zh: 活着

source: Username
de: Benutzername
zh: 帐号

source: Turn an On/Off Output On, Off, or On for a duration.
de: Schalten Sie einen Ausgangskanal AUS, AN oder AN für eine gewisse Dauer.

source: State
de: Status
zh: 然后陈述

source: Set a PWM Output to set a duty cycle.
de: eine Ausgabe an ein PWM-Tastverhältnis eingestellt.

source: Ramp a PWM Output from one duty cycle to another duty cycle over a period of time.
de: Rampenschaltung eines PWM-Ausgangs von einem Tastverhältnis zu einem anderen Tastverhältnis über einen bestimmten Zeitraum.

source: Start
de: Anfang
zh: 开始

source: End
de: Ende
zh: 结束

source: Increment
de: Zuwachs
zh: 增量

source: Send a value to the Output.
de: Einen Wert an den Augang senden.
zh: 发送一个输出值

source: Instruct the Output to dispense a volume.
de: Weisen Sie die Ausgabe an, ein Volumen zu dosieren.
zh: 指示输出分配一个体积。

source: Set a delay between executing Actions when self.run_all_actions() is used.
de: Setzt eine Verzögerung zwischen Aktionen, wenn self.run_all_actions () verwendet wird.
zh: self.run_all_actions（）用于当执行设置操作之间的延迟。

source: Capture Photo
de: Foto einfangen
zh: 捕获照片

source: Capture a photo with the selected Camera.
de: Nehmen Sie ein Foto mit der ausgewählten Kamera.
zh: 捕捉与选择的相机拍照。

source: Set Method
de: Methode einstellen

source: Select a method to set the PID to use.
de: Wählen Sie eine Methode, um die PID zu Verwendung einzustellen.
zh: 选择的PID设置为使用的方法。

source: Pause a PID.
de: PID pausieren.
zh: 暂停PID。

source: Resume a PID.
de: Fortsetzen einer PID.
zh: 恢复一个PID。

source: Set
de: Satz

source: Set the Setpoint of a PID.
de: Stellen Sie den Sollwert eines PID.
zh: 设置一个PID的设定值。

source: Lower the Setpoint of a PID.
de: Stellen Sie den Sollwert eines PID.

source: Lower Setpoint
de: Unterer Sollwert
zh: 设定值更低

source: Raise the Setpoint of a PID.
de: Stellen Sie den Sollwert eines PID.

source: Restart
de: Neustart
zh: 重启

source: Shutdown
de: Abschaltung
zh: 关闭

source: The maximum age of the measurement to use
de: Das maximale Alter der zu verwendenden Messung
zh: 测量的最大时长（秒），以用于温度补偿

source: Select a measurement the selected output will affect
de: Wählen Sie eine Messung, auf die sich die gewählte Ausgabe auswirken soll
zh: 选择所选输出将影响的测量

source: Select an output to control that will affect the measurement
de: Wählen Sie einen zu steuernden Ausgang, der die Messung beeinflusst

source: The desired setpoint
de: Der gewünschte Sollwert

source: Hysteresis
de: Hysterese
zh: 滞后

source: The amount above and below the setpoint that defines the control band
de: Der Betrag oberhalb und unterhalb des Sollwerts, der das Regelband definiert

source: Last Timelapse Image
de: Letzte Zeitrafferaufnahme

source: Last Still Image
de: Letzter Schnappschuss

source: Last Video
de: Letzte Videoaufnahme

source: Image
de: Bild

source: Width
de: Breite

source: Height
de: Höhe

source: Contrast
de: Kontrast
zh: 对比

source: Sharpness
de: Schärfe
zh: 锐度

source: Shutter Speed
de: Verschlusszeit
zh: 快门速度

source: Microseconds
de: Mikrosekunden

source: White Balance
de: Weißabgleich
zh: 白平衡

source: Rotate
de: Drehen

source: Degrees
de: Grad

source: Wet/Dry-Bulb
de: Nass-/Trockenkugel

source: Dry Bulb
de: Trockene Glühbirne
zh: 干燥

source: Wet Bulb
de: Nasse Glühbirne
zh: 潮湿

source: Noise Band
de: Lärmband
zh: 噪音带

source: Outstep
de: Ausstieg

source: pH
de: pH-Wert
zh: 酸碱度

source: Measurements to Average
de: Messungen Durchschnittliche
zh: 测量平均

source: The number of times to measure each channel. An average of the measurements will be stored.
de: Die Anzahl der Male, jeden Kanal zu messen. Ein Durchschnitt der Messungen werden gespeichert.
zh: 的次数来测量每个信道。在测量的平均值将被保存。

source: Temperature Compensation
de: Temperatur-Kompensation

source: Select a measurement for temperature compensation
de: Wählen Sie eine Messung für die Temperaturkompensation
zh: 选择温度补偿的测量

source: Set the calibration method to perform during Input activation
de: Legen Sie die Kalibrierungsmethode fest, die während der Aktivierung der Eingänge ausgeführt werden soll
zh: 设置校准方法以在输入激活期间执行

source: Range
de: Bereich
zh: 范围

source: Calibrate
de: kalibrieren
zh: 校准

source: Internal
de: intern
zh: 内置

source: Buffer ORP
de: Puffer ORP
zh: ORP缓存

source: Clear Calibration
de: Kalibrierung entfernen
zh: 清除校准结果

source: New I2C Address
de: Neue I2C-Adresse

source: The new I2C to set the device to
de: Das neue I2C zum Einstellen des Geräts auf

source: Set I2C Address
de: I2C-Adresse einstellen

source: Internal Resistor
de: interner Widerstand
zh: 内部电阻

source: Always On
de: Immer eingeschaltet

source: Always Off
de: Immer aus

source: Only On During Measure
de: Nur während der Maßnahme eingeschaltet

source: LED Mode
de: LED-Modus

source: Manual
de: Handbuch

source: When to turn the LED on
de: Wann soll die LED eingeschaltet werden

source: Temperature Offset
de: Temperatur-Offset

source: Pulses per Liter
de: Impulse pro Liter

source: Command Timeout
de: Befehl Timeout
zh: 命令超时

source: Current Working Directory
de: Das aktuelle Arbeitsverzeichnis der Shell-Umgebung
zh: shell环境的当前工作目录

source: Username for connecting to the server
de: Benutzername für die Verbindung zum Server
zh: 用于连接到服务器的用户名

source: Channel
de: Show-Kanal

source: Store Measurement
de: Erzwinge Messung

source: IP Address
de: IP Adresse
zh: IP地址

source: Sensor Name
de: Name des Sensors

source: API Key
de: API-Schlüssel

source: Latitude (decimal)
de: Breitengrad (dezimal)
zh: 纬度（十进制）

source: Longitude (decimal)
de: Längengrad (dezimal)
zh: 经度（十进制）

source: Time
de: Zeit

source: City
de: Stadt

source: Please log in to access this page
de: Bitte Anmelden um Zugriff zur Seite zu erhalten
zh: 请登录访问此页

source: Backup in progress
de: Sicherung läuft
zh: 正在备份

source: Deletion of backup in progress
de: Backuplöschung läuft
zh: 删除正在进行的备份

source: Restore in progress
de: Wiederherstellung läuft
zh: 正在恢复

source: There was an error encountered during the upgrade process. Check the upgrade log for details.
de: Fehler beim Upgrade. Detailinformationen erhalten Sie im Upgrade-Logfile.
zh: 升级过程中遇到错误。检查升级日志以获取详细信息。

source: The upgrade (from master branch) has started
de: Upgrade (von Master Branch) wurde gestartet
zh: 升级（来自主分支）已启动

source: The upgrade has started
de: Upgrade wurde gestartet
zh: 升级已经开始

source: The major version upgrade has started
de: Das Hauptversion Upgrade wurde gestartet
zh: 主要版本升级已经开始

source: You cannot upgrade if an upgrade is not available
de: Upgrade nicht möglich, wenn kein Upgrade verfügbar ist
zh: 如果升级不可用，则无法升级

source: Cannot access admin creation form if an admin user already exists.
de: Anlegen eines Adminzuganges nicht möglich, wenn bereits ein Admin besteht.
zh: 如果管理员用户已存在，则无法访问管理员创建表单。

source: Passwords do not match. Please try again.
de: Passwortübereinstimmung falsch. Bitte versuchen Sie es erneut.
zh: 密码不匹配。请再试一次。

source: Invalid username. Must be between 3 and 64 characters and only contain letters and numbers.
de: Ungültiger Benutzername. Muss zwischen 3 und 64 Zeichen lang sein und darf nur Buchstaben und Zahlen enthalten.
zh: 无效的用户名。必须在3到64个字符之间，并且只包含字母和数字。

source: Invalid password. Must be between 4 and 64 characters and only contain letters and numbers.
de: Ungültiges Passwort. Muss zwischen 4 und 64 Zeichen lang sein und darf nur Buchstaben und Zahlen enthalten.

source: User '%(user)s' successfully created. Please log in below.
de: Benutzer ‚%(user)s’ erfolgreich angelegt. Bitte einloggen.
zh: 用户 '%(user)s' 已成功创建。请在下面登录。

source: Failed to create user '%(user)s': %(err)s
de: Fehler beim Anlegen des Benutzer %(user)s‘: %(err)s
zh: 无法创建用户 '%(user)s': %(err)s

source: Cannot access login page if you're already logged in
de: Login Seite nicht aufrufbar, wenn Sie bereits angemeldet sind
zh: 如果您已经登录，则无法访问登录页面

source: Too many failed login attempts. Please wait %(min)s minutes before attempting to log in again
de: Zuviel falsche Anmeldungen. Bitte warten Sie %(min)s Minuten für den nächsten Versuch
zh: 登录尝试失败次数过多。请等待 %(min)s 分钟，然后再尝试登录

source: Successfully logged out
de: Erfolgreich abgemeldet
zh: 成功退出

source: System rebooting in 10 seconds
de: Systemneustart in 10 Sekunden
zh: 系统在10秒内重启

source: System shutting down in 10 seconds
de: Systemabschaltung in 10 Sekunden
zh: 系统在10秒内关闭

source: Command to restart the daemon sent
de: Befehl zum Backend Neustart gesendet
zh: 用于重新启动守护程序的命令

source: Cannot start stream if time-lapse is active.
de: Stream kann nicht gestartet werden, wenn Zeitraffer aktiv ist.
zh: 如果延时有效，则无法启动流。

source: Invalid password. Must be between 6 and 64 characters and only contain letters, numbers, and symbols.
de: Ungültiges Passwort. Passwort muß zwischen 6 und 64 Zeichen (Nummer, Zahlen und Sonderzeichen) haben.
zh: 无效的密码。必须介于6到64个字符之间，且只能包含字母，数字和符号。

source: Code expired or invalid
de: Der Code ist abgelaufen oder ungültig

source: Language
de: Sprache
zh: 语言

source: Repeat Password
de: Passwortwiederholung
zh: 重复输入密码

source: Reset Method
de: Reset-Methode

source: Save Reset Code to File
de: Reset-Code in Datei speichern

source: Submit
de: Einreichen
zh: 提交

source: Change Password
de: Passwort ändern

source: Domain or IP Address
de: Domain oder IP Adresse
zh: 域或IP地址

source: Add Host
de: Anbieter hinzufügen
zh: 添加主机

source: Delete Host
de: Anbieter löschen
zh: 删除主机

source: I Understand
de: Ich akzeptiere
zh: 我明白

source: Capture Still
de: Weiter aufnehmen
zh: 捕获仍然

source: Start Timelapse
de: Starte Zeitraffer
zh: 开始Timelapse

source: Pause Timelapse
de: Pause Zeitraffer
zh: 暂停游戏中时光倒流

source: Resume Timelapse
de: Zeitraffer fortsetzen
zh: 恢复游戏中时光倒流

source: Stop Timelapse
de: Zeitraffer beenden
zh: 停止尕

source: Interval
de: Intervall

source: Photo Interval must be a positive value
de: Fotointervall muss positiver Wert sein
zh: 照片间隔必须是正值

source: Run Time
de: Laufzeit

source: Total Run Time must be a positive value
de: Die Gesamtlaufzeit muss ein positiver Wert sein
zh: 总运行时间必须是正值

source: Start Stream
de: Starte Stream
zh: 开始流

source: Stop Stream
de: Beende Stream
zh: 停止流
