Repository: nonomal/Mycodo
Catalog: mycodo/mycodo_flask/translations/*/LC_MESSAGES/messages.po
Languages: de, zh

source: The new entry's start time may be equal to the last entry's end time, but it cannot overlap. The default setpoint for the PID will be used if there is any unaccounted time.
de: Die Startzeit des neuen Eintrags kann der Endzeit des letzten Eintrags entsprechen, aber nicht überlappen. Der voreingestellte Sollwert für die PID wird verwendet, wenn eine nicht erfasste Zeit vorhanden ist.
zh: 新条目的开始时间可能等于最后一个条目的结束时间，但不能重叠。如果有任何未计时的时间，将使用PID的默认设定值。

source: Define the setpoint over the day based on a cubic Bezier curve. If unfamiliar with a Bezier curve, it is recommended you use the <a href="https://www.desmos.com/calculator/cahqdxeshd" target="_blank">graphical Bezier curve generator</a> and use the 8 variables it creates for 4 points (each a set of x and y). The x-axis start (x3) and end (x0) will be automatically stretched or skewed to fit within a 24-hour period and this method will repeat daily.
de: Definieren Sie den Sollwert über den Tag basierend auf einer kubischen Bezier-Kurve. Wenn Sie mit einer Bezier-Kurve nicht vertraut sind, sollten Sie den <a href="https://www.desmos.com/calculator/cahqdxeshd" target="_blank">grafischen Bezier-Kurvengenerator</a> verwenden und die 8 verwenden Variablen erstellt es für 4 Punkte (jeweils eine Menge von x und y). Der x-Achsenstart (x3) und das Ende (x0) werden automatisch gedehnt oder verschoben, um innerhalb eines 24-Stunden-Zeitraums zu passen, und diese Methode wird täglich wiederholt.
zh: 基于三次贝塞尔曲线定义一天中的设定值。如果不熟悉贝塞尔曲线，建议您使用<a href="https://www.desmos.com/calculator/cahqdxeshd" target="_blank">图形贝塞尔曲线生成器</a>并使用它为4个点创建的8个变量（每个变量都是一组x和y）。 x轴开始（x3）和结束（x0）将自动拉伸或倾斜以适应24小时内，此方法将每天重复。

source: Define the setpoint over the day based on a sinusoidal wave defined by y = [A * sin(B * x + C)] + D, where A is amplitude, B is frequency, C is the angle shift, and D is the y-axis shift. This method will repeat daily.
de: Definieren Sie den Sollwert über den Tag basierend auf einer sinusförmigen Welle definiert durch y = [A * sin(B * x + C)] + D, wobei A die Amplitude, B die Frequenz, C die Winkelverschiebung und D das y ist -Achsverschiebung. Diese Methode wird täglich wiederholt.
zh: 基于由y = [A * sin（B * x + C）] + D定义的正弦波定义一天中的设定值，其中A是幅度，B是频率，C是角度偏移，D是y - 轴移位。这种方法每天都会重复。

source: Define the setpoint over a period of time based on specific times/dates.
de: Definieren Sie den Sollwert über einen Zeitraum basierend auf bestimmten Zeiten / Daten.
zh: 根据特定时间/日期定义一段时间内的设定值。

source: Define the setpoint over a period of time, based on specific durations of time.
de: Definieren Sie den Sollwert über einen bestimmten Zeitraum basierend auf bestimmten Zeitdauern.
zh: 根据特定的持续时间，在一段时间内定义设定值。

source: Duration here is defined as the amount of time after the previous duration. If this is the first duration added, this will be the beginning of the method. If this is not the first duration added, it will execute after the last duration already in the method.
de: Dauer hier ist definiert als die Zeit nach der vorherigen Dauer. Wenn dies die erste hinzugefügte Dauer ist, ist dies der Anfang der Methode. Wenn dies nicht die erste hinzugefügte Dauer ist, wird sie nach der letzten bereits in der Methode vorhandenen Dauer ausgeführt.
zh: 此处的持续时间定义为上一个持续时间之后的时间量。如果这是第一个添加的持续时间，这将是方法的开头。如果这不是添加的第一个持续时间，它将在方法中已经存在的最后一个持续时间之后执行。

source: Use the following options to instruct the method to restart when it reaches the end.
de: Verwenden Sie die folgenden Optionen, um die Methode anzuweisen, bei Erreichen des Endes neu zu starten.
zh: 使用以下选项指示方法在到达结束时重新启动。

source: If you do not wish for the method to repeat, do not use this option.
de: Wenn Sie nicht möchten, dass die Methode wiederholt wird, verwenden Sie diese Option nicht.
zh: 如果您不希望重复此方法，请不要使用此选项。

source: You may enter a duration (seconds) that the method will end after, otherwise leave blank to repeat forever.
de: Sie können eine Dauer (Sekunden) eingeben, nach der die Methode enden wird. Andernfalls lassen Sie das Feld leer, um es für immer zu wiederholen.
zh: 您可以输入方法将结束的持续时间（秒），否则留空以永久重复。

source: Action Settings
de: Aktionseinstellungen

source: Imported Action Modules
de: Importierte Aktionsmodule

source: Alerts Settings
de: E-Mail Einstellungen
zh: 提醒设置

source: Leave blank to use default port for protocol
de: Leer lassen, um den Standardport für das Protokoll zu verwenden

source: Email protocol to send with
de: E-Mail-Protokoll zum Senden mit

source: Usually your full email address
de: Ihre vollständige E-Mail-Adresse
zh: 通常是您的完整邮箱地址

source: Only enter a password here if you wish to change it
de: Geben Sie hier nur ein Passwort ein, wenn Sie es ändern möchten
zh: 如果您想更改密码，请在此处输入密码

source: Maximum number of alerts that can be emailed per hour.
de: Maximale Anzahl von Warnungen, die per E-Mail gesendet werden können.
zh: 每小时可通过电子邮件发送的最大警报数。

source: Function Settings
de: Funktion Einstellungen

source: Import Function Module
de: Funktionsmodul importieren

source: Imported Function Modules
de: Importierte Funktionsbausteine

source: General Settings
de: Allgemeine Einstellungen
zh: 常规设置

source: Which page to land on after logging in
de: Welcher Seite nach dem Einloggen soll aufgerufen werden
zh: 登录后要登陆的页面

source: Which page to land on after clicking brand link (top-corner link)
de: Auf welcher Seite Sie nach dem Anklicken des Markenlinks landen (Link oben in der Ecke)

source: Same as Landing Page
de: Gleich wie Landing Page

source: Set the timeout (seconds) for Pyro connections (client-daemon communication). Requires daemon restart.
de: Stellen Sie das Timeout (in Sekunden) für Pyro-Verbindungen (Client-Daemon-Kommunikation). Erfordert Daemon neu zu starten.
zh: 设置的Pyro连接（客户守护程序通信）的超时时间（秒）。需要守护重启。

source: Enable Daemon debug logging for diagnosing issues. Requires Daemon restart.
de: Aktivieren Daemon Debug-Protokollierung für Probleme zu diagnostizieren. Benötigt Daemon neu zu starten.
zh: 启用后台程序的调试日志记录来诊断问题。需要守护进程重新启动。

source: Check to force all web connections to use SSL (port 443) for greater security.
de: Aktivieren Sie diese Option, um alle Webverbindungen zur Verwendung von SSL (Port 443) für höhere Sicherheit zu erzwingen.
zh: 选中此选项可强制所有Web连接使用SSL（端口443）以提高安全性。

source: Check to prevent Success alert messages from appearing at the top of the page.
de: Aktivieren Sie diese Option, um zu verhindern, dass Erfolgsmeldungen oben auf der Seite angezeigt werden.
zh: 检查以防止成功警报消息显示在页面顶部。

source: Check to prevent Info alert messages from appearing at the top of the page.
de: Aktivieren Sie diese Option, um zu verhindern, dass Info-Warnmeldungen oben auf der Seite angezeigt werden.
zh: 检查以防止信息警报消息出现在页面顶部。

source: Check to prevent Warning alert messages from appearing at the top of the page.
de: Aktivieren Sie diese Option, um zu verhindern, dass Warnmeldungen oben auf der Seite angezeigt werden.
zh: 检查以防止警告警报消息出现在页面顶部。

source: Hide tooltips that pop up over form inputs.
de: Tooltips ausblenden, die bei Formulareingaben angezeigt werden.
zh: 隐藏弹出表单输入的工具提示。

source: Check if you do not wish to send anonymous usage statistics.
de: Überprüfen Sie, ob Sie keine anonymen Nutzungsstatistiken senden möchten.
zh: 检查您是否不希望发送匿名使用情况统计信息。

source: View collected statistics
de: Gesammelte Statistiken anzeigen
zh: 查看收集的统计信

source: The heigth of the grid cell, in pixels.
de: Die Höhe der Gitterzelle in Pixeln.
zh: 网格单元的heigth，以像素为单位。

source: The IP address to test if there is an active internet connection required to allow upgrading.
de: Die IP-Adresse zu testen, ob es eine aktive Internetverbindung zu ermöglichen, das Upgrade erforderlich.
zh: IP地址，以测试是否有允许升级需要一个有效的互联网连接。

source: The port of the internet test IP address.
de: Die Port der Internet-Test IP-Adresse.
zh: 网络测试IP地址的端口。

source: The timeout period (seconds) for testing the internet connection.
de: Die Timeout-Zeit (Sekunden) für die Prüfung der Internet-Verbindung.
zh: 超时时间（秒）用于测试互联网连接。

source: Check if you would like Mycodo to automatically check for upgrades.
de: Überprüfen Sie, ob Mycodo automatisch nach Upgrades suchen soll.
zh: 检查您是否希望Mycodo自动检查升级。

source: Set the maximum allowed amperage to be switched on at any given time
de: Stellen Sie die maximal erlaubte Stromstärke zu einem bestimmten Zeitpunkt ein
zh: 设置在任何给定时间打开的最大允许安培数

source: Set the voltage used to power the devices powered by the outputs
de: Stellen Sie die Spannung ein, mit der die von den Ausgängen versorgten Geräte betrieben werden
zh: 设置用于为输出供电的设备供电的电压

source: Set the cost per kilowatt-hour
de: Stellen Sie die Kosten pro Kilowattstunde ein
zh: 设定每千瓦时的成本

source: Set the unit of currency used to pay for the electricity
de: Stellen Sie die Währungseinheit ein, in der Strom bezahlt wird
zh: 设置用于支付电费的货币单位

source: Set a day of the month to calculate monthly power usage
de: Legen Sie einen Tag des Monats fest, um den monatlichen Stromverbrauch zu berechnen
zh: 设置一个月中的某天来计算每月用电量

source: Automatically generate output usage reports on a daily/weekly/monthly schedule
de: Generieren Sie automatisch Ausgabenachrichten zu einem täglichen / wöchentlichen / monatlichen Zeitplan
zh: 自动生成每日/每周/每月计划的输出使用报告

source: How often to generate a report
de: Wie oft soll ein Bericht erstellt werden
zh: 生成报告的频率

source: Day Options: Daily: 1-7 (1=Monday), Monthly: 1-28
de: Tag Optionen: Täglich: 1-7 (1=Montag), Monatlich: 1-28
zh: 日期选项：每日：1-7（1 =星期一），每月：1-28

source: Input Settings
de: Eingabeeinstellungen
zh: 输入设置

source: Imported Input Modules
de: Importierte Eingabemodule
zh: 导入的输入模块

source: Units
de: Einheiten
zh: 单位

source: Conversions
de: Umwandlungen
zh: 转换

source: All
de: Alle
zh: 所有

source: Output Settings
de: Ausgabe-Einstellungen

source: Imported Output Modules
de: Importierte Ausgangsmodule

source: Raspberry Pi Settings
de: Raspberry Pi Geräte Einstellungen
zh: Raspberry Pi设置

source: User Settings
de: Benutzereinstellungen
zh: 用户设置

source: Which page to land on before logging in
de: Auf welcher Seite Sie vor dem Einloggen landen

source: Keypad
de: Tastenfeld

source: Roles
de: Rollen
zh: 角色

source: Widget Settings
de: Widget-Einstellungen

source: Imported Widget Modules
de: Importierte Widget-Module

source: Notes
de: Anmerkungen
zh: 笔记

source: Edit Note
de: Notiz bearbeiten
zh: 编辑注释

source: Manage
de: Verwalten
zh: 管理

source: Select one or more tags
de: Wählen Sie ein oder mehrere Tags aus
zh: 选择一个或多个标签

source: Found
de: Gefunden
zh: 发现

source: Daemon response: %(resp)s
de: Daemon-Antwort %(resp)s
zh: 守护进程响应: %(resp)s

source: Deactivate controller before modifying its settings
de: Deaktivieren Sie den Controller, bevor Sie die Einstellungen ändern
zh: 在修改其设置之前停用控制器

source: Dashboard with ID %(id)s successfully added
de: Armaturenbrett mit der ID %(id)s erfolgreich hinzugefügt
zh: 用ID %(id)s 信息中心s成功加入

source: {dev} with ID %(id)s successfully added
de: {dev} mit ID %(id)s wurde erfolgreich hinzugefügt
zh: 已成功添加ID为 %(id)s 的{dev}

source: Entry with ID %(id)s not found
de: Eintrag mit ID %(id)s wurde nicht gefunden
zh: 未找到ID为 %(id)s 的条目

source: Error in the %(field)s field - %(err)s
de: Fehler in %(field)s Feld - %(err)s
zh: %(field)s 字段中的错误 - %(err)s

source: Cannot move above the first item in the list
de: Kann nicht über den ersten Eintrag in der Liste hinausgehen
zh: 无法移动到列表中的第一个项目之上

source: Cannot move below the last item in the list
de: Kann nicht unter den letzten Eintrag in der Liste hinausgehen
zh: 无法移动到列表中的最后一项之下

source: Choose a Read Period equal to or greater than 7. The AM2315 may become unresponsive if the period is below 7.
de: Wählen Sie einen Lesezeitraum gleich oder größer als 7. Der AM2315 reagiert möglicherweise nicht mehr, wenn der Zeitraum unter 7 liegt.
zh: 选择等于或大于7的读取周期。如果周期低于7，AM2315可能会无响应。

source: The Read Period cannot be less than the Pre Output Duration
de: Der Lesezeitraum darf nicht kürzer als die Vorausgabedauer sein
zh: 读取周期不能小于预输出持续时间

source: Invalid device or improper permissions to read device
de: Ungültiges Gerät oder falsche Berechtigungen zum Lesen des Geräts
zh: 设备无效或读取设备的权限不正确

source: Pin (GPIO) must be set
de: Pin (GPIO) muss eingestellt werden
zh: 引脚（GPIO）必须设置

source: Activate controller before attempting to force the acquisition of measurements
de: Aktivieren Sie den Controller, bevor Sie versuchen, die Messwerterfassung zu erzwingen
zh: 在尝试强制采集测量之前激活控制器

source: Duration must be a positive integer
de: Die Dauer muss eine positive ganze Zahl sein
zh: 持续时间必须是正整数

source: Duration must be a valid integer
de: Die Dauer muss eine gültige Ganzzahl sein
zh: 持续时间必须是有效整数

source: The end time must be after the start time.
de: Die Endzeit muss nach der Startzeit liegen.
zh: 结束时间必须在开始时间之后。

source: Error: Angle Shift is out of range. It must be <= 0 and <= 360.
de: Fehler: Winkelverschiebung liegt außerhalb des zulässigen Bereichs. Es muss <= 0 und <= 360 sein.
zh: 错误：角度偏移超出范围。它必须<= 0且<= 360。

source: Error: X0 must be greater than X3.
de: Fehler: X0 muss größer als X3 sein.
zh: 错误：X0必须大于X3。

source: The new entry start time (%(st)s) cannot overlap the last entry's end time (%(et)s). Note: They may be the same time.
de: Die Anfangszeit des neuen Eintrags (%(st)s) darf nicht mit der Endzeit des letzten Eintrags (%(et)s) überlappen. Hinweis: Sie können die gleiche Zeit sein.
zh: 新的条目开始时间 (%(st)s) 不能与最后一个条目的结束时间 (%(et)s) 重叠。注意：它们可能是同一时间。

source: Added duration to method from %(st)s to %(end)s
de: Die Dauer wurde der Methode von %(st)s bis %(end)s hinzugefügt
zh: 从 %(st)s 到 %(end)s 增加了方法的持续时间

source: Added method restart
de: Neustart der Methode hinzugefügt
zh: 添加方法重启

source: Added duration to method for %(sec)s seconds
de: Methode für %(sec)s Sekunden wurde der Dauer hinzugefügt
zh: 为 %(sec)s 秒增加了方法的持续时间

source: The entry start time (%(st)s) cannot overlap the previous entry's end time (%(et)s)
de: Die Anfangszeit des Eintrags (%(st)s) darf die Endzeit des vorherigen Eintrags nicht überschreiten (%(et)s)
zh: 进入开始时间 (%(st)s) 不能与前一个条目的结束时间重叠 (%(et)s)

source: The entry end time (%(et)s) cannot overlap the next entry's start time (%(st)s)
de: Die Endzeit des Eintrags (%(et)s) darf die Startzeit des nächsten Eintrags nicht überlappen (%(st)s)
zh: 输入结束时间 (%(et)s) 不能与下一个条目的开始时间 (%(st)s) 重叠

source: Energy Usage with ID %(id)s (%(uuid)s) successfully added
de: Energie-Verbrauch mit der ID %(id)s (%(uuid)s) erfolgreich hinzugefügt
zh: 用ID %(id)s %(uuid)s 或多个）能量使用成功添加

source: File
de: Datei
zh: 文件

source: Raise and lower outputs cannot be the same
de: Anhebung und Absenkung können nicht gleich sein
zh: 提升和降低输出不能相同

source: Cannot activate PID controller if the associated Input controller is inactive
de: PID-Regler kann nicht aktiviert werden, wenn der zugehörige Eingangsregler nicht aktiv ist

source: Cannot activate PID controller if raise and/or lower output IDs are not selected
de: Der PID-Regler kann nicht aktiviert werden, wenn Erhöhungs- und/oder Absenkungs-IDs nicht ausgewählt sind
zh: 如果未选择上升和/或下限输出ID，则无法激活PID控制器

source: Remote Host %(host)s with ID %(id)s (%(uuid)s) successfully added
de: Remote Host %(host)s mit ID %(id)s (%(uuid)s) erfolgreich hinzugefügt
zh: 已成功添加ID为 %(id)s (%(uuid)s) 的远程主机 %(host)s

source: Error: %(err)s
de: Fehler: %(err)s
zh: 错误: %(err)s

source: User Role
de: Benutzer-Rolle
zh: 用户角色

source: Invalid user name. Must be between 2 and 64 characters and only contain letters and numbers.
de: Ungültiger Benutzername. Benutzername muß zwischen 2 und 64 Zeichen (Nummer und Zahlen) haben.
zh: 无效的用户名。必须介于2到64个字符之间，且只能包含字母和数字。

source: Another user already has that email address.
de: Ein anderer Benutzer hat bereits diese E-Mail-Adresse.
zh: 另一位用户已拥有该电子邮件地址。

source: Invalid password
de: Ungültiges Passwort
zh: 无效的密码

source: Measurement with ID %(id)s (%(uuid)s) successfully added
de: Messung mit ID %(id)s (%(uuid)s) erfolgreich hinzugefügt
zh: 成功添加ID %(id)s (%(uuid)s) 的测量值

source: Unit
de: Einheit
zh: 单元

source: Unit with ID %(id)s (%(uuid)s) successfully added
de: Einheit mit ID %(id)s (%(uuid)s) wurde erfolgreich hinzugefügt
zh: 已成功添加ID为 %(id)s (%(uuid)s) 的单位

source: Conversion
de: Umwandlung
zh: 转变

source: Conversion with ID %(id)s (%(uuid)s) successfully added
de: Konvertierung mit ID %(id)s (%(uuid)s) erfolgreich hinzugefügt
zh: 已成功添加ID为 %(id)s (%(uuid)s) 的转换

source: Pi Settings
de: Raspberry Pi Einstellungen
zh: Pi设置

source: Alert Settings
de: E-Mail Einstellungen
zh: 警报设置

source: Test email sent to %(recip)s. Check your inbox to see if it was successful.
de: Test-E-Mail an %(recip)s gesendet. Überprüfen Sie bitte den Posteingang, um zu sehen, ob er erfolgreich war.
zh: 测试发送给 %(recip)s 的电子邮件。检查收件箱是否成功。

source: Stepper Motor
de: Schrittmotor

source: Generic
de: Allgemein

source: Set to None to disable.
de: Zum Deaktivieren auf Keine setzen.

source: On/Off
de: ein/aus

source: The pin to control the state of
de: Der Stift zur Kontrolle des Zustands von

source: Trigger Functions at Startup
de: Funktionen beim Starten auslösen

source: Current
de: Strom

source: I/O Expander
de: E/A-Erweiterung

source: On Payload
de: Zur Nutzlast

source: Off Payload
de: Aus Nutzlast

source: Python code to execute when the output is instructed to turn on
de: Python-Code, der ausgeführt werden soll, wenn der Ausgang eingeschaltet werden soll

source: Python code to execute when the output is instructed to turn off
de: Python-Code, der ausgeführt werden soll, wenn der Ausgang ausgeschaltet werden soll

source: Set the state when Mycodo starts
de: Legen Sie den Status beim Start von Mycodo fest

source: Set the state when Mycodo shuts down
de: Legen Sie den Zustand fest, wenn Mycodo herunterfährt

source: Whether to trigger functions when the output switches at startup
de: ob Funktionen ausgelöst werden sollen, wenn der Ausgang beim Starten schaltet

source: The current draw of the device being controlled
de: Die Stromaufnahme des zu steuernden Geräts

source: Wireless
de: Drahtlos

source: Protocol
de: Protokoll
zh: 协议

source: Pulse Length
de: Pulslänge
zh: 脉冲长度

source: Always send the command, regardless of the current state
de: Senden Sie den Befehl immer, unabhängig vom aktuellen Zustand

source: Spacer
de: Abstandshalter
zh: 间隔

source: Digital Potentiometer
de: Digitales Potentiometer

source: Peristaltic Pump
de: Peristaltische Pumpe

source: Frequency (Hertz)
de: Frequenz (Hertz)
zh: 频率（赫兹）

source: Invert Signal
de: Signal invertieren
zh: 反转信号

source: Invert Stored Signal
de: Gespeichertes Signal invertieren

source: LED Controller
de: LED-Steuerung

source: Bash Command
de: Bash-Befehl

source: The value when Mycodo starts
de: Der Wert beim Start von Mycodo

source: The value when Mycodo shuts down
de: Der Wert, wenn Mycodo herunterfährt

source: Invert the PWM signal
de: Invertieren des PWM-Signals

source: Remote
de: Fernsteuerung

source: The host or IP address of the remote Mycodo
de: Hostname oder IP-Adresse der ferngesteuerten Mycodo Instanz

source: The API key of the remote Mycodo
de: API-Schlüssel ferngesteuerten Mycodo Instanz

source: Digital-to-Analog Converter
de: Digital-Analog-Wandler

source: Off Value
de: Aus Wert

source: Select the camera to display
de: Wählen Sie die anzuzeigende Kamera

source: Acquire Image (and save new file)
de: Bild erfassen (und neue Datei speichern)
zh: 获取图像（并保存新文件）

source: Display Live Video Stream
de: Live-Videostream anzeigen
zh: 显示实时视频流

source: Display Latest Timelapse Image
de: Anzeige des letzten Zeitrafferbildes
zh: 显示最新的间隔拍摄图像

source: Show Timestamp
de: Zeige Zeitleiste
zh: 显示时间戳

source: Show the timestamp on the widget
de: Anzeige des Zeitstempels im Widget

source: Select the Controller to Activate or Deactivate
de: Wählen Sie den Controller zum Aktivieren oder Deaktivieren

source: Select a Function to display the status of
de: Wählen Sie eine Funktion, um den Status von

source: Select a measurement to display
de: Wählen Sie eine Messung zur Anzeige aus

source: Select measurements to display
de: Auswahl der anzuzeigenden Messungen

source: PIDs
de: PISs
zh: 的PID

source: Note Tags
de: Beachten Sie Tags
zh: 注意标签

source: Show Unit
de: Show-Einheit
zh: 示范单位

source: Show the unit
de: Die Einheit anzeigen

source: Show Name
de: Name anzeigen
zh: 展会名称

source: Show the name
de: Den Namen anzeigen

source: Show Channel
de: Show-Kanal
zh: 展会频道

source: Show the channel
de: Den Kanal anzeigen

source: Show Measurement
de: Show Mess
zh: 测量显示

source: Show the measurement
de: Die Messung anzeigen

source: Show the timestamp
de: Anzeige des Zeitstempels

source: Enable Timestamp
de: Zeitstempel einschalten

source: Timestamp Font Size (em)
de: Zeitstempel Schriftgröße (em)

source: The font size of the timestamp
de: Die Schriftgröße des Zeitstempels

source: Decimal Places
de: Dezimalstellen
zh: 小数位

source: The number of decimal places to display
de: Die Anzahl der anzuzeigenden Dezimalstellen

source: Enable Status
de: Status freigeben

source: Show the current output status
de: Anzeige des aktuellen Ausgabestatus

source: Enable Value
de: Wert freigeben

source: Show the current value
de: Den aktuellen Wert anzeigen

source: Enable Unit
de: Einheit freigeben

source: Show the value unit
de: Anzeige der Werteinheit

source: Enable Output Controls
de: Aktivieren der Ausgangssteuerungen

source: Show output controls on the widget
de: Ausgabesteuerungen auf dem Widget anzeigen

source: Select the output to display and control
de: Wählen Sie den Ausgang zur Anzeige und Steuerung

source: Invert Status
de: Status invertieren

source: Invert the output status. Enable if the Invert Signal output option is set.
de: Invertiert den Ausgangsstatus. Aktivieren, wenn die Option Signalausgang invertieren eingestellt ist.

source: PID Controller
de: PID-Regler

source: Select the PID Controller to display and control
de: Wählen Sie den PID-Regler zur Anzeige und Steuerung aus

source: Show PID Info
de: PID-Informationen anzeigen

source: Show the current PID output values
de: Anzeige der aktuellen PID-Ausgangswerte

source: Show Set Setpoint
de: Zeige Sollwert setzen
zh: 显示设定值

source: Enable the setpoint to be set
de: Ermöglicht die Einstellung des Sollwerts

source: Enable Loop
de: Schleife aktivieren

source: Enable the Python Code (Loop) to be executed every Period
de: Aktivieren Sie den Python-Code (Schleife), der in jedem Zeitraum ausgeführt wird

source: Python Code (Loop)
de: Python-Code (Schleife)

source: Python code to execute in a loop
de: Python-Code zur Ausführung in einer Schleife

source: Python Code (On Refresh)
de: Python-Code (Bei Neuladen)

source: Python code to execute every dashboard/widget refresh
de: Python-Code zur Ausführung bei jeder Aktualisierung des Dashboards/Widgets

source: Boolean
zh: 布尔

source: Minute
zh: 分钟

source: Celsius
zh: 摄氏

source: Fahrenheit
zh: 华氏度

source: Gigabyte
zh: 吉比特

source: Hertz
zh: 赫兹

source: Kelvin
zh: 开

source: Kilobyte
zh: 千字节

source: Kilohertz
zh: 千赫

source: Kilopascal
zh: 千帕

source: Liter
zh: 升

source: Lux
zh: 勒克司

source: Meter
zh: 仪表

source: Milliliter
zh: 毫升

source: Millimeter
zh: 毫米

source: Millivolt
zh: 毫伏

source: Megahertz
zh: 兆赫

source: Megabyte
zh: 兆字节

source: Ohm
zh: 欧姆

source: Pascal
zh: 帕斯卡尔

source: Volt
zh: 伏特

source: Watt
zh: 瓦

source: Bluetooth Adapter (hci[X])
zh: 蓝牙适配器（hci [X]）

source: Bus
zh: 总线

source: Dashboard
zh: 仪表板

source: E-Mail
zh: 电子邮件

source: Export
zh: 出口

source: I2C Bus
zh: i2c总线

source: Import
zh: 进口

source: LCD
zh: 液晶显示屏

source: Login
zh: 登录

source: Pause
zh: 暂停

source: Reset
zh: 重启

source: Single
zh: 单

source: System
zh: 系统

source: Text
zh: 文本

source: Timer
zh: 计时器

source: Widget
zh: 窗口小部件

source: Baud Rate
zh: 波特率

source: Deadline
zh: 期限

source: ml/min
zh: 毫升每分钟

source: Log Level: Debug
zh: 日志级别：调试

source: Name
zh: 名称

source: Port
zh: 港口

source: Start Offset
zh: 开始 使用补偿

source: Hostname
zh: 主机名

source: Raise Setpoint
zh: 提高设定值

source: mV
zh: 毫伏

source: Start HH:MM:SS
zh: 启动HH：MM：SS

source: Amplitude
zh: 振幅

source: Log
zh: 日志

source: View Log
zh: 查看日志
