Repository: nonomal/Mycodo
Catalog: mycodo/mycodo_flask/translations/*/LC_MESSAGES/messages.po
Languages: de, zh

source: OpenCV Device
de: OpenCV Gerät
zh: OpenCV设备

source: Flip image horizontally
de: Bild horizontal spiegeln
zh: 水平翻转图像

source: Flip image vertically
de: Bild vertikal spiegeln
zh: 垂直翻转图像

source: Rotate Image
de: Bild drehen
zh: 旋转图像

source: Exposure
de: Exposition
zh: 曝光

source: Custom Options
de: Benutzerdefinierte Optionen
zh: 自定义选项

source: Pre Command
de: Vorbefehl
zh: 前命令

source: Post Command
de: Nachbefehl
zh: 后命令

source: Still Image Path
de: Standbildpfad
zh: 静止图像路径

source: Timelapse Path
de: Timelapse-Pfad
zh: 间隔拍摄路径

source: Video Path
de: Videopfad
zh: 视频路径

source: Hide Last Still
de: Hide Last Noch
zh: 隐藏最后还是

source: Hide Last Timelapse
de: Letzte Zeitraffer ausblenden
zh: 隐藏最后缩时

source: Show Preview
de: Vorschau anzeigen

source: Output Format
de: Ausgangszustand

source: Still Image Width
de: Standbildbreite
zh: 静止图像宽度

source: Still Image Height
de: Noch Bildhöhe
zh: 静止图像高度

source: Stream Width
de: Stream Breite
zh: 河流宽度

source: Stream Height
de: Stream-Höhe
zh: 流高度

source: Stream Frames Per Second
de: Stream Frames pro Sekunde

source: Auto White Balance
de: Automatischer Weißabgleich
zh: 自动白平衡

source: AWB Gain Red
de: AWB Verstärker Red
zh: AWB增益红色

source: AWB Gain Blue
de: AWB Verstärker Blau
zh: AWB增益蓝色

source: Exposure Mode
de: Belichtungsmodus
zh: 曝光模式

source: Meter Mode
de: Zähler-Modus
zh: 表模式

source: Image Effect
de: Bildeffekt
zh: 图像效果

source: Still HTTP Address
de: Noch HTTP-Adresse

source: Stream HTTP Address
de: Stream-HTTP-Adresse

source: Headers (JSON)
de: Kopfzeilen (JSON)

source: Image Set
de: Bildersatz

source: Frames Per Second
de: Einzelbilder pro Sekunde

source: Generate Video
de: Video generieren

source: Import Python Code
de: Eingabemodul importieren

source: Initialize Python Code
de: Python-Code initialisieren

source: Run Python Code
de: Python-Code ausführen

source: Refractory Period
de: Refraktärzeit

source: Timeout
de: Zeitüberschreitung

source: Number of Measurements
de: Anzahl der Messungen
zh: 测量次数

source: Add Dashboard Widget
de: In Dashboard Widget
zh: 添加控制台Dashboard Widget

source: Enable Drag Handle
de: Aktivieren Ziehen Griff
zh: 启用拖动手柄

source: Install All Dependencies
de: Installieren Sie alle Abhängigkeiten
zh: 安装所有依赖项

source: Execute All Actions
de: Alle Aktionen ausführen
zh: 执行所有操作

source: Location
de: Ort
zh: 位置

source: Power Output
de: Leistung
zh: 功率输出

source: Calibration Measurement
de: Kalibrierungsmessung
zh: 校准测量

source: Bounce Time (ms)
de: Prellzeit (ms)
zh: 弹跳时间（ms）

source: Acquire Measurements Now
de: Jetzt Messwerte erwerben
zh: 立即获取测量值

source: End HH:MM:SS
de: Ende HH:MM:SS
zh: 结束HH：MM：SS

source: Start YYYY-MM-DD HH:MM:SS
de: Beginn JJJJ-MM-TT HH:MM:SS
zh: 开始YYYY-MM-DD HH：MM：SS

source: End YYYY-MM-DD HH:MM:SS
de: Ende YYYY-MM-DD HH:MM:SS
zh: 结束YYYY-MM-DD HH：MM：SS

source: Start Setpoint
de: Sollwert starten
zh: 启动设定点

source: End Setpoint (optional)
de: Sollwert beenden (optional)
zh: 结束设定值（可选）

source: Duration to End
de: Dauer bis Ende

source: Angle Shift (0 to 360)
de: Winkelverschiebung (0 bis 360)
zh: 角度偏移（0到360）

source: Y-Axis Shift
de: Y-Achsenverschiebung
zh: Y轴移位

source: Time HH:MM:SS
de: Zeit HH:MM:SS
zh: 时间HH：MM：SS

source: Time YYYY-MM-DD HH:MM:SS
de: Zeit YYYY-MM-DD HH:MM:SS
zh: 时间YYYY-MM-DD HH：MM：SS

source: Add to Method
de: Zur Methode hinzufügen
zh: 添加到方法

source: Set Repeat Option
de: Wiederholungsoption einstellen
zh: 设置重复选项

source: End Setpoint
de: Sollwert beenden
zh: 结束设定点

source: Time Range MM/DD/YYYY HH:MM
de: Zeitspanne MM/DD/YYYY HH:MM
zh: 时间范围DD / MM / YYYY HH：MM

source: Stop Daemon
de: Beende Daemon
zh: 停止守护进程

source: Start Daemon
de: Starte Daemon
zh: 启动守护进程

source: Restart Daemon
de: Deamon Neustart
zh: 重启守护进程

source: Measurement to Export
de: Messung Export
zh: 出口计量

source: Export Data as CSV
de: Datenexport (CSV)
zh: 将数据导出为CSV

source: Export Settings
de: Exporteinstellungen
zh: 导出设置

source: Import Settings
de: Import Einstellungen
zh: 导入设置

source: Export Influxdb
de: Influxdb exportieren
zh: 导出Influxdb

source: Lines
de: Zeilen
zh: 行

source: Number of lines should be greater than 0
de: Zeilanzahl muß größer 0 sein
zh: 行数应大于0

source: Search
de: Suche
zh: 搜索

source: Upgrade Mycodo
de: Mycodo aktualisieren
zh: 升级Mycodo

source: Upgrade Mycodo to Next Major Version
de: Upgrade Mycodo zur nächsten Hauptversion
zh: 将Mycodo升级到下一个主要版本

source: Download Backup
de: Backup herunterladen

source: Create Backup
de: Erstelle Sicherung
zh: 创建备份

source: Restore Backup
de: Backup wiederherstellen
zh: 恢复备份

source: Delete Backup
de: Sicherung löschen
zh: 删除备份

source: Attached Files
de: Angehängte Dokumente
zh: 附加的文件

source: Use Custom Date/Time
de: Benutzerdefiniertes Datum / Uhrzeit verwenden
zh: 使用自定义日期/时间

source: Filter Names
de: Filtern Sie Namen
zh: 过滤器名称

source: Filter Tags
de: Tags filtern
zh: 过滤标签

source: Filter Files
de: Dateien filtern
zh: 过滤文件

source: Filter Notes
de: Hinweise filtern
zh: 过滤笔记

source: Sort By
de: Sortiere nach
zh: 排序方式

source: Sort Direction
de: Sortierrichtung
zh: 排序方向

source: Show Notes
de: Notizen anzeigen
zh: 显示备注

source: Export Notes
de: Notizen exportieren
zh: 出口说明

source: Import Notes
de: Notizen importieren
zh: 导入便笺

source: Turn On
de: Anschalten
zh: 打开

source: Both
de: Beide
zh: 都

source: Band (+/- Setpoint)
de: Band (+/- Sollwert)
zh: 乐队（+/-设定点）

source: Send Lower as Negative
de: Speichere Niedriger al negativ

source: Store Lower as Negative
de: Speichere Niedriger al negativ
zh: 存储较低为负

source: Kp Gain
de: Kp Gewinn

source: Ki Gain
de: Ki Gewinn

source: Kd Gain
de: Kd Geweinn

source: Action
de: Aktion

source: Min On Duration
de: Min Ein Dauer

source: Max On Duration
de: Maximale Einschaltdauer

source: Min Off Duration
de: Min Aus Dauer

source: Min Amount
de: Mindestbetrag

source: Max Amount
de: Maximaler Betrag

source: Min On Amount
de: Min. Ein-Betrag

source: Max On Amount
de: Max. Ein Betrag

source: Min Duty Cycle
de: Minimale Einschaltdauer

source: Max Duty Cycle
de: Maximale Auslastung

source: SMTP Protocol
de: SMTP-Protokoll

source: SMTP User
de: SMTP Benutzer
zh: SMTP用户

source: SMTP Password
de: PMTP Passwort
zh: SMTP密码

source: From Email
de: Absender E-Mail
zh: 来自电邮

source: Max emails (per hour)
de: Maximale E-Mails (pro Std.)
zh: 最大电子邮件数（每小时）

source: Must have at least one message able to be sent per hour.
de: Mindestens eine Nachricht pro Stunde muß gesendet werden können.
zh: 必须至少有一条消息能够每小时发送一次。

source: Send Test Email
de: Sende Test E-Mail
zh: 发送测试邮件

source: Test Email To
de: Test E-Mail Empfänger
zh: 测试电子邮件到

source: To Email Address
de: E-Mail Empfänger Adresse
zh: 电邮地址

source: Landing Page
de: Zielseite
zh: 登陆页面

source: Index Page
de: Index Seite

source: Enable Daemon Debug Logging
de: Aktivieren Daemon Debug Logging
zh: 启用后台程序调试日志记录

source: Force HTTPS
de: Erzwinge HTTPS
zh: 强制HTTPS

source: Hide success messages
de: Erfolgsnachrichten ausblenden
zh: 隐藏成功消息

source: Hide info messages
de: Info-Nachrichten ausblenden
zh: 隐藏信息消息

source: Hide warning messages
de: Verstecke Warn-Meldungen
zh: 隐藏警告消息

source: Hide Form Tooltips
de: Tooltips ausblenden
zh: 隐藏表单工具提示

source: Database
de: Datenbank

source: Retention Policy
de: Aufbewahrungsrichtlinie

source: Database Name
de: Datenbankname

source: Grid Cell Height (px)
de: Rasterzellenhöhe (px)
zh: 格单元格高度（PX）

source: Max Amps
de: Max Ampere
zh: 最大安培

source: Cost per kWh
de: Kosten pro kWh
zh: 每千瓦时的成本

source: Currency Unit
de: Währungseinheit
zh: 货币单位

source: Day of Month
de: Tag des Monats
zh: 一个月的一天

source: Generate Usage/Cost Report
de: Verbrauchs- / Kostenbericht generieren
zh: 生成使用/成本报告

source: Time Span to Generate
de: Zeitspanne generieren
zh: 生成时间跨度

source: Day of Week/Month to Generate
de: Tag der Woche / Monat generieren
zh: 生成星期/月的日子

source: Hour of Day to Generate
de: Stunde des Tages generieren
zh: 生成的一天中的小时

source: Hour Options: 0-23
de: Stunden-Optionen 0-23
zh: 小时选项：0-23

source: Opt-out of statistics
de: Opt-out der Statistiken
zh: 选择退出统计数据

source: Check for Updates
de: Auf Updates überprüfen
zh: 检查更新

source: Internet Test IP Address
de: Internet-Test-IP-Adresse
zh: 网络测试IP地址

source: Sample Rate
de: Stichprobenrate

source: Import Controller Module
de: Import-Controller-Modul
zh: 导入控制器模块

source: Import Action Module
de: Eingabemodul importieren

source: Import Input Module
de: Eingabemodul importieren
zh: 导入输入模块

source: Import Output Module
de: Import-Ausgangsmodul

source: Import Widget Module
de: Widget-Modul importieren

source: Measurement ID
de: Mess ID
zh: 测量ID

source: Measurement Name
de: Messungsname
zh: 测量名称

source: Measurement Units
de: Messeinheiten
zh: 测量单位

source: Add Measurement
de: Messung hinzufügen
zh: 添加测量

source: Unit ID
de: Geräte-ID
zh: 单位ID

source: Unit Name
de: Einheitenname
zh: 单位名称

source: Unit Abbreviation
de: Abkürzung der Einheit
zh: 单位缩写

source: Add Unit
de: Einheit hinzufügen
zh: 添加单位

source: Convert From Unit
de: Von Einheit umrechnen
zh: 从单位转换

source: Convert To Unit
de: In Einheit konvertieren
zh: 转换为单位

source: Add Conversion
de: Konvertierung hinzufügen
zh: 添加转换

source: Role Name
de: Benutzerrollen Name
zh: 角色名称

source: View Logs
de: Logs anzeigen
zh: 查看日志

source: View Stats
de: Statistiken anzeigen
zh: 查看统计信息

source: View Camera
de: Kamera anzeigen
zh: 查看相机

source: View Settings
de: Einstellungen anzeigen
zh: 查看设置

source: Edit Users
de: Benutzer bearbeiten
zh: 编辑用户

source: Edit Controllers
de: Controller bearbeiten
zh: 编辑控制器

source: Edit Settings
de: Einstellungen bearbeiten
zh: 编辑设置

source: Reset Password
de: Passwort zurücksetzen

source: Add Role
de: Benutzerrolle hinzufügen
zh: 添加角色

source: Default Login Page
de: Standard-Anmeldeseite

source: Passwords must match
de: Passwort muss stimmen
zh: 密码必须匹配

source: Password must be 6 or more characters
de: Passwort muss mind. 6 Zeichen haben
zh: 密码必须是6个或更多字符

source: Keypad Code
de: Tastenfeld Code

source: Role
de: Benutzerrolle
zh: 角色

source: Add User
de: Benutzer hinzufügen
zh: 添加用户

source: New Password
de: Neues Paswort
zh: 新密码

source: Role ID
de: Benutzerrollen ID
zh: 角色ID

source: Enable I2C
de: I2C aktivieren
zh: 启用I2C

source: Disable I2C
de: I2C deaktivieren
zh: 禁用I2C

source: Enable 1-Wire
de: 1-Wire aktivieren
zh: 启用1-Wire

source: Disable 1-Wire
de: 1-Wire deaktivieren
zh: 禁用1-Wire

source: Enable Serial
de: Serien aktivieren
zh: 启用串行

source: Disable Serial
de: Serien deaktivieren
zh: 禁用串行

source: Enable SPI
de: SPI aktivieren
zh: 启用SPI

source: Disable SPI
de: SPI deaktivieren
zh: 禁用SPI

source: Enable SSH
de: SSH aktivieren
zh: 启用SSH

source: Disable SSH
de: SSH deaktivieren
zh: 禁用SSH

source: Change Hostname
de: Hostname ändern
zh: 更改主机名

source: Configure pigpiod
de: Pigpoid konigurieren
zh: 配置pigpiod

source: Reconfigure
de: Rekonfigurieren
zh: 重新配置

source: Delete All Dashboards
de: Alle löschen Armaturenbretter
zh: 删除所有信息中心

source: Delete All Inputs
de: Alle Eingaben löschen
zh: 删除所有输入

source: Delete All Notes and Note Tags
de: Löschen Sie alle Notizen und Hinweis-Tags
zh: 删除所有注释和注释标签

source: Delete All Outputs
de: Alle Ausgaben löschen
zh: 删除所有输出

source: Delete Settings Database
de: Einstellungsdatenbank löschen
zh: 删除设置数据库

source: Delete File
de: Datei löschen
zh: 删除文件

source: Reset Email Counter
de: Reset Email Zähler
zh: 重置邮件计数器

source: Install Dependencies
de: Installieren Sie alle Abhängigkeiten

source: Regenerate Widget HTML
de: Widget HTML neu generieren

source: Set to Upgrade to Master
de: Auf Upgrade auf Master einstellen

source: If Edge Detected
de: Wenn Grenze gefunden
zh: 如果检测到边缘

source: Rise or Set
de: Erhöhung oder Festlegen
zh: 上升或设定

source: Zenith
de: Höhepunkt
zh: 顶点

source: Date Offset (days)
de: Datums Offset (Tage)
zh: 日期偏移（天）

source: Time Offset (minutes)
de: Zeit Offset (Minuten)
zh: 时间偏移（分钟）

source: Program
de: Programm
zh: 程序

source: Word
de: Wort
zh: 字

source: Start Time (HH:MM)
de: Startzeit (HH:MM)
zh: 开始时间（HH：MM）

source: End Time (HH:MM)
de: Endzeit (HH:MM)
zh: 结束时间（HH：MM）

source: Trigger Every Period
de: Auslöser jeder Dauer
zh: 触发每个时期

source: Trigger when Activated
de: Auslösen wenn aktiviert
zh: 激活时触发

source: If ID 1
de: Wenn ID 1
zh: 如果ID为1

source: If ID 2
de: Wenn ID 2
zh: 如果是ID 2

source: If State
de: Wenn Status
zh: 如果是国家

source: If Duration
de: Wenn Dauer

source: If Duty Cycle (%%)
de: Wenn Pflicht-Umkreis (%%)
zh: 如果占空比（%%）

source: Error 404: Page Not Found
de: Fehler 404: Seite nicht gefunden
zh: 错误404：找不到页面

source: Error 500: Internal Server Error
de: Fehler 500: interner Server-Fehler
zh: 错误500：内部服务器错误

source: Create Admin
de: Admin erstellen
zh: 创建管理员

source: Welcome to Mycodo
de: Willkommen bei Mycodo
zh: 欢迎来到 Mycodo

source: This appears to be a new Mycodo install. Please create an administrator user. Read and accept the agreement to begin.
de: Dies scheint eine neue Mycodo-Installation zu sein. Bitte legen Sie einen Administrator-Benutzer an. Lesen und akzeptieren Sie die Vereinbarung, um zu beginnen.
zh: 这似乎是一个新的Mycodo安装。请创建一个管理员用户。阅读并接受协议，开始。

source: NO WARRANTY NOTICE
de: Haftungsausschluss
zh: 无保修通知

source: Mycodo is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. Mycodo is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with Mycodo. If not, see <a href="http://www.gnu.org/licenses/" target="_blank">http://www.gnu.org/licenses/</a>.
de: Mycodo ist freie Software: Es kann unter den Bedingungen der GNU General Public License v3 oder neuer (wie veröffentlicht durch die Free Software Foundation) verändert und verbreitet werden. Mycodo wird bereitgestellt in der Hoffnung von nutzen zu sein, JEDOCH OHNE GEWÄHR; nicht einmal implizierte Gewähr für Marktfähigkeit oder Eignung für einen bestimmten Zweck. Für mehr Details ist die GNU General Public License zu prüfen. Eine Kopie der GNU General Public License sollte mit Mycodo ausgeliefert worden sein. Falls nicht ist diese unter <a href="http://www.gnu.org/licenses/" target="_blank">http://www.gnu.org/licenses/</a> zu finden.
zh: Mycodo 是自由软件：您可以根据自由软件基金会发布的 GNU 通用公共许可证条款（许可证第 3 版或任何后续版本，由您选择）重新发布和/或修改 Mycodo。发布 Mycodo 的目的是希望它有用，但不附带任何保证；甚至不附带适销性或特定用途适用性的默示保证。详情请参见 GNU 通用公共许可证。您应该随 Mycodo 一起收到一份 GNU 通用公共许可证。如果没有，请参阅<a href="http://www.gnu.org/licenses/" target="_blank">http://www.gnu.org/licenses/</a> 。

source: Mycodo collects anonymous usage statistics to aid with development. You can opt-out at any time from the Configuration page, after you log in.
de: Mycodo sammelt anonymisierte Nutzungsstatistiken um die Entwicklung zu unterstützen. Dies kann nach dem Login jederzeit in den Einstellungen deaktiviert werden.

source: Login information is stored locally
de: Anmeldeinformationen werden lokal gespeichert
zh: 登录信息存储在本地

source: Usernames must be 3 to 64 characters, passwords >3 characters, and contain only letters and numbers
de: Benutzernamen müssen aus 3 bis 64 Zeichen bestehen, Passwörter aus mehr als 3 Zeichen und dürfen nur Buchstaben und Zahlen enthalten
zh: 用户名必须是3至64个字符，密码>3个字符，并且只包含字母和数字

source: Warning
de: Warnung

source: Setup
de: Einrichtung
zh: 建立

source: Exit
de: Ausgang
zh: 出口

source: Inputs
de: Eingaben
zh: 输入

source: Outputs
de: Ausgaben
zh: 输出

source: Functions
de: Funktionen

source: Measurements
de: Messungen
zh: 测量

source: Users
de: Benutzer
zh: 用户

source: Alerts
de: Benachrichtigungen
zh: 警报

source: Diagnostics
de: Diagnose
zh: 诊断

source: Daemon is Not Running
de: Daemon läuft nicht
zh: 守护程序未运行

source: Daemon is Running
de: Daemon läuft
zh: 守护进程正在运行

source: Cannot Check Daemon Status
de: Daemon Status kann nicht ermittelt werden
zh: 无法检查守护程序状态

source: No Connection
de: Keine Verbindung
zh: 无连接

source: Dashboards
de: Armaturenbretter
zh: 仪表板

source: Add Dashboard
de: In Armaturenbrett
zh: 添加仪表板

source: More
de: Mehr
zh: 更多

source: Amp Measure
de: Strom Messung

source: Help
de: Hilfe
zh: 帮帮我

source: API Docs
de: API Dokumentation

source: Mycodo on Github
de: Mycodo bei Github
zh: Github上的Mycodo

source: Submit an Issue
de: Ein Problem melden
zh: 提交问题

source: Edit Translations
de: Übersetzungen bearbeiten

source: Changelog
de: Änderungsprotokoll
zh: 更新日志

source: Configure
de: Konfigurieren
zh: 配置

source: Dependencies
de: Abhängigkeiten
zh: 依赖

source: Backup Restore
de: Backup wiederherstellen
zh: 备份还原

source: Restart Backend
de: Backend neu starten
zh: 重启后端

source: Restart Frontend
de: Frontend neu starten
zh: 重启前端

source: Restart System
de: System Neustart
zh: 重启系统

source: Shutdown System
de: System abschalten
zh: 关机系统

source: Preferences
de: Präferenzen

source: Logout
de: Ausloggen
zh: 登出

source: Selecting a language will override the web browser's language
de: Wenn Sie eine Sprache auswählen, wird die Sprache des Webbrowsers überschrieben
zh: 选择语言将覆盖Web浏览器的语言

source: Close
de: Schließen

source: You're logged in already!
de: Sie sind bereits eingeloggt!
zh: 你已经登录了！

source: Log In
de: Einloggen

source: Password Login
de: Passwort Anmeldung

source: Remember me
de: Erinnere dich an mich
zh: 记住账号

source: 90 days
de: 90 Tage
zh: 90天

source: Forgot password?
de: Passwort vergessen?
zh: 忘记密码？

source: Keypad Login
de: Anmeldung über die Tastatur

source: Backups can be created to preserve Mycodo settings or restore them at a later time. Camera images are not backed up. To save measurement data, go to the Export / Import page.
de: Sicherungen können erstellt werden, um Mycodo-Einstellungen beizubehalten oder sie zu einem späteren Zeitpunkt wiederherzustellen. Kamerabilder werden nicht gesichert. Um Messdaten zu speichern, gehen Sie zur Seite Export / Import.
zh: 可以创建备份以保留Mycodo设置或稍后恢复它们。相机图像未备份。要保存测量数据，请转到“导出/导入”页面。

source: Several software dependencies used by Mycodo features may be disabled. This is done to speed up the initial installation process. This page can be used to determine which dependencies are installed and the ability to install currently unmet dependencies.
de: Mehrere von Mycodo-Funktionen verwendete Softwareabhängigkeiten sind möglicherweise deaktiviert. Dies wird getan, um den anfänglichen Installationsprozess zu beschleunigen. Diese Seite kann verwendet werden, um festzustellen, welche Abhängigkeiten installiert sind, und die Möglichkeit, derzeit nicht erfüllte Abhängigkeiten zu installieren.
zh: 可能会禁用Mycodo功能使用的几个软件依赖项。这样做是为了加快初始安装过程。此页面可用于确定安装了哪些依赖项以及安装当前未满足的依赖项的功能。

source: Statistics
de: Statistiken
zh: 统计

source: Collected Statistics
de: Gesammelte Statistiken
zh: 收集的统计数据

source: No internet connection detected. To upgrade Mycodo automatically, you will need an internet connection. Refresh the page when one is connected.
de: Keine Internetverbindung gefunden. Um Mycodo automatisch zu aktualisieren, benötigen Sie eine Internetverbindung. Aktualisieren Sie die Seite, wenn eine Verbindung besteht.
zh: 未检测到互联网连接。要自动升级Mycodo，您需要连接互联网。连接一个页面时刷新页面。

source: Mycodo is currently in the process of an upgrade
de: Mycodo wird gerade aktualisiert
zh: Mycodo目前正在升级

source: An upgrade often takes several minutes, and in some cases longer, to complete. Give the process ample time to run before doing anything. When the upgrade has successfully finished, the daemon status indicator at the top left will change from red to green. Some drivers require the backend to be restarted for them to become active. If you experience an erorr, attempt to restart the backend before creating a new github issue.
de: Ein Upgrade dauert in der Regel mehrere Minuten und in manchen Fällen auch länger. Geben Sie dem Prozess ausreichend Zeit, bevor Sie etwas tun. Wenn das Upgrade erfolgreich abgeschlossen wurde, ändert sich die Statusanzeige des Dämons oben links von rot auf grün. Einige Treiber erfordern einen Neustart des Backends, damit sie aktiv werden. Wenn ein Fehler auftritt, versuchen Sie, das Backend neu zu starten, bevor Sie ein neues Github-Problem erstellen.
zh: 升级通常需要几分钟，在某些情况下需要更长时间才能完成。在做任何事情之前给这个过程充足的时间来运行。升级成功完成后，左上角的守护程序状态指示器将从红色变为绿色。某些驱动程序需要重新启动后端才能使它们变为活动状态。如果遇到erorr，请在创建新的github问题之前尝试重新启动后端。

source: You can monitor the upgrade progress with the live log view, below, by navigating to Configure -> Mycodo Logs -> Upgrade Log, or by opening /var/log/mycodo/mycodoupgrade.log. Below is the upgrade log, updated every 5 seconds. If an error occurs, it is advisable to inspect the entire log in order to diagnose the issue.
de: Sie können den Fortschritt der Aktualisierung mit dem Live-Protokollansicht überwachen, unten, von zu konfigurieren Navigation -> Mycodo Logs -> Upgrade Log, oder durch Öffnen /var/log/mycodo/mycodoupgrade.log. Im Folgenden finden Sie das Upgrade-Protokoll, alle 5 Sekunden aktualisiert. Wenn ein Fehler auftritt, ist es ratsam, das gesamte Protokoll, um zu prüfen, das Problem zu diagnostizieren.
zh: 您可以监控与实时日志查看升级的进度，下面，通过导航到配置 - > Mycodo日志 - >升级日志，或通过打开/var/log/mycodo/mycodoupgrade.log。下面是升级日志，每5秒更新一次。如果发生错误，建议检查整个日志以诊断问题。

source: There was an error that occurred during the upgrade
de: Während des Upgrades ist ein Fehler aufgetreten
zh: 升级期间发生错误

source: View the upgrade log at /var/log/mycodo/mycodoupgrade.log.
de: Schauen Sie das Upgrade-Protokoll unter /var/log/mycodo/mycodoupgrade.log an.
zh: 在/var/log/mycodo/mycodoupgrade.log中查看升级日志。

source: No upgrade is available. You are running the latest release, version
de: Es ist kein Upgrade verfügbar. Sie führen die neueste Version aus
zh: 没有升级可用。您正在运行最新版本的版本

source: Click the button below to begin the upgrade process. Note: An upgrade often takes several minutes, and in rare cases hours, to complete. During that time, the Mycodo web interface and server recording sensors and manipulating outputs (among other services) will be completely shut down. It is not recommended not perform an upgrade on a production machine (i.e. trust buy verify: treat the new version as unstable until you have verified it works as expected).
de: Klicken Sie auf die Schaltfläche unten, um mit dem Upgrade zu beginnen. Hinweis: Ein Upgrade dauert oft mehrere Minuten und in seltenen Fällen Stunden. Während dieser Zeit werden die Mycodo-Webinterface- und Serveraufzeichnungssensoren und die Manipulationsausgänge (neben anderen Diensten) vollständig heruntergefahren. Es wird nicht empfohlen, keine Aktualisierung auf einer Produktionsmaschine durchzuführen (z. B. Vertrauenskaufprüfung: Behandeln Sie die neue Version als instabil, bis Sie sichergestellt haben, dass sie wie erwartet funktioniert).
zh: 单击下面的按钮开始升级过程。注意：升级通常需要几分钟，在极少数情况下需要几小时才能完成。在此期间，Mycodo Web界面和服务器记录传感器和操作输出（以及其他服务）将完全关闭。建议不要在生产计算机上执行升级（即信任购买验证：将新版本视为不稳定，直到您验证其按预期工作为止）。

source: Current to latest versions
de: Aktuelle zur neuesten Version
zh: 当前到最新版本

source: current
de: aktuellle
zh: 当前

source: latest
de: neueste/letzte
zh: 最新

source: Are you sure you want to delete this?
de: Sind Sie sicher, dass Sie dies löschen wollen?

source: Cameras
de: Kameras
zh: 相机

source: Timelapse
de: Zeitraffer

source: The interval that photos will be acquired
de: Das Intervall, in dem die Fotos erfasst werden

source: How long to run before stopping. Set 0 to run forever.
de: Wie lange der Vorgang läuft, bevor er gestoppt wird. Stellen Sie 0 ein, um für immer zu laufen.

source: Raspberry Pi Camera support doesn't appear to be enabled. Please enable it using the Raspberry Pi configuration or with the command 'sudo raspi-config'
de: Die Raspberry-Pi-Kamera-Unterstützung scheint nicht aktiviert zu sein. Bitte aktivieren Sie es mit der Raspberry Pi-Konfiguration oder mit dem Befehl 'sudo raspi-config'
zh: Raspberry Pi Camera支持似乎未启用。请使用Raspberry Pi配置或命令'sudo raspi-config'启用它
